Repository: AlphaWallet/alpha-wallet-ios
Catalog: AlphaWallet/Localization/*.lproj/Localizable.strings
Languages: es, fi, ja, ko, zh_hans

# a.wallet.token.transfer.noteLabel.title
source: Before the link expires, anyone with the MagicLink can claim your tickets with one click
es: Antes de que expire el enlace, cualquiera que tenga el MagicLink puede reclamar tus tickets con un clic
fi: Kuka tahansa voi noutaa toimeksiantosi MagicLink-linkkiä käyttäen sen voimassaoloajan
ja: リンクの有効期限が切れる前に、MagicLink を持つユーザーはワンクリックであなたのチケットを請求できます
ko: 링크가 만료되기 전에 MagicLink가 있는 사람은 한 번 클릭하여 고객님의 티켓을 수령할 수 있습니다
zh_hans: 在 MagicLink 链接过期之前，任何人均可通过点击此链接来索取您的门票

# a.wallet.token.transfer.success.title
source: Your %@ has been transferred
es: Tu %@ se ha transferido
fi: %@ on lähtetty
ja: %@ が送信されました
ko: %@이(가) 전송되었습니다
zh_hans: 已转出您的%@

# a.wallet.token.transfer.failed.title
source: Your %@ was not transferred
es: Tu %@ no se ha transferido
fi: %@ ei voitu lähtettää
ja: %@ が送信されませんでした
ko: %@이(가) 전송되지 않았습니다
zh_hans: 尚未转出您的%@

# a.wallet.token.transfer.inProgress.title
source: Transferring %@...
es: Transfiriendo %@...
fi: Lähtettää %@...
ja: %@ を送信しています...
ko: %@ 전송 중...
zh_hans: 正在转出%@...

# a.wallet.token.marketPrice
source: Market Price: %@ %@
es: Precio de mercado: %@ %@
fi: Markkinahinta: %@ %@
zh_hans: 市场价格： %@ %@

# a.wallet.token.value
source: Value: %@
es: Valor: %@
fi: Arvo: %@
zh_hans: 价值： %@

# a.wallet.tokenBundle.status.sold.title
source: Sold
es: Vendido
fi: Myyty
ja: 売却済み
ko: 판매됨
zh_hans: 已出售

# a.wallet.tokenBundle.status.redeemed.title
source: Redeemed
es: Canjeado
fi: Lunastettu
ja: 交換済み
ko: 상환됨
zh_hans: 已兑换

# a.wallet.tokenBundle.status.transferred.title
source: Transferred
es: Transferido
fi: Lähtetty
ja: 送信済み
ko: 전송됨
zh_hans: 已转出

# a.wallet.tokenBundle.status.forSale.title
source: For Sale
es: En venta
fi: Myynnissä
ja: 売却可能
ko: 판매용
zh_hans: 待售

# a.wallet.contents.value.period.title
source: 24 HOURS
es: 24 HORAS
fi: 24 TUNTIA
ja: 24 時間
ko: 24시간
zh_hans: 24 小时

# a.wallet.contents.value.appreciation.title
source: APPRECIATION
es: VALORACIÓN
fi: ARVONNOUSU
ja: 上昇
ko: 평가
zh_hans: 升值

# a.wallet.contents.value.dollar.title
source: USD VALUE
es: VALOR EN USD
fi: USD-ARVO
ja: 米ドル値
ko: USD 가치
zh_hans: 等值美元

# a.wallet.contents.filter.all.title
source: All
es: Todo
fi: Kaikki
ja: すべての
ko: 모두
zh_hans: 全部

# a.wallet.contents.filter.currencyOnly.title
source: Currencies
es: Monedas
fi: Valuutat
ja: 通貨
ko: 통화
zh_hans: 币类

# a.wallet.contents.filter.assetsOnly.title
source: Assets
es: Activos
fi: Omaisuus
ja: 資産
ko: 자산
zh_hans: 资产类

# a.wallet.contents.filter.collectiblesOnly.title
source: Collectibles
es: Coleccionables
fi: NFT
zh_hans: 收藏品

# a.wallet.contents.issuer.title
source: Issuer
es: Emisor
fi: Liikkeeseenlaskija
ja: 発行者
ko: 발행자
zh_hans: 发行方

# a.wallet.next.button.title
source: Next
es: Siguiente
fi: Seuraava
ja: 次へ
ko: 다음
zh_hans: 下一步

# a.wallet.no.tokens
source: You don't have any tokens
es: No tienes ningún token
fi: Ei rahakkeita
ja: まだトークンがありません
ko: 토큰이 없습니다
zh_hans: 您没有任何通证

# a.help.navigation.title
source: Help & FAQs
es: Ayuda y preguntas frecuentes
fi: Tuki & UKK (FAQ)
ja: ヘルプ・よくある質問
ko: 도움말 및 자주 묻는 질문
zh_hans: 帮助和常见问题

# a.help.assetDefinitionOverrides.title
source: TokenScript Overrides
es: Sustituciones de TokenScript
fi: TokenScript-tiedostojen ohitukset
zh_hans: TokenScript 覆盖

# a.console.title
source: Console
es: Consola
fi: Tekstikonsoli
zh_hans: 控制台

# a.help.contact.footer.button.title
source: Still need help? Contact Us
es: ¿Sigues necesitando ayuda? Contacta con nosotros
fi: Vieläkö tarvitset apua? Ota yhteyttä
ja: まだヘルプが必要ですか? 当社にお問い合わせください
ko: 아직 도움이 필요하세요? 고객 문의
zh_hans: 需要更多帮助？联系我们

# a.help.contents.howDoIGetMyMoney
source: How do I get my money?
es: ¿Cómo obtengo mi dinero?
fi: Kuinka pääsen käsiksi rahoihini?
ja: 私のお金をどのようにして受け取りますか?
ko: 내 돈을 어떻게 받습니까?
zh_hans: 怎样才能拿到法币?

# a.help.contents.howDoITransferETHIntoMyWallet
source: How do I transfer ETH into my wallet?
es: ¿Cómo transfiero ETH a mi monedero?
fi: Kuinka siirrän ETH-rahakkeita lompakkooni?
ja: ETH を私のウォレットに送信する方法は?
ko: ETH를 내 지갑으로 어떻게 전송합니까?
zh_hans: 怎样把以太币转到AlphaWallet内?

# a.help.contents.privacyPolicy
source: Privacy Policy
es: Política de privacidad
fi: Tietosuojakäytännöt
ja: プライバシー ポリシー
ko: 개인정보 취급방침
zh_hans: 隐私政策

# a.help.contents.termsOfService
source: Terms of Service
es: Condiciones de servicio
fi: Käyttöehdot
ja: サービス利用規約
ko: 서비스 약관
zh_hans: 服务条款

# a.wallet.address.scan.instructions
source: Scan the QR Code or copy the text below:
es: Escanea el código QR o copia el siguiente texto:
fi: Lue tästä QR-koodi tai kopioi osoite tekstinä alta:
ja: QR コードをスキャンするか以下のテキストをコピーします:
ko: QR 코드를 스캔하거나 아래 텍스트를 복사하십시오.
zh_hans: 扫描QR码或者复制下面的文字:

# a.wallet.address.title
source: My %@ Wallet Address
es: La dirección de mi monedero de %@
fi: Oman %@-lompakon osoite
ja: 私の %@ ウォレットのアドレス
ko: 내 %@ 지갑 주소
zh_hans: 我的%@钱包地址

# a.settings.navigation.title
source: Settings
es: Ajustes
fi: Asetukset
ja: 設定
ko: 설정
zh_hans: 设置

# a.advanced.settings.navigation.title
source: Advanced
es: Avanzado
fi: Lisäasetukset
zh_hans: 高级

# a.settings.contents.myWalletAddress
source: My Wallet Address
es: La dirección de mi monedero
fi: Tämän lompakon osoite
ja: 私のウォレットのアドレス
ko: 내 지갑 주소
zh_hans: 我的钱包地址

# a.settings.contents.clearDappBrowserCache
source: Clear Browser cache
es: Borrar la caché del navegador
fi: Tyhjennä selaimen välimuisti
zh_hans: 清除浏览器缓存

# a.welcome.navigation.title
source: Welcome
es: Bienvenido
fi: Tervetuloa!
ja: ようこそ
ko: 환영합니다
zh_hans: 欢迎

# a.welcome.onboarding.1
source: Hold all your Crypto assets in one place
es: Almacena todos tus activos criptográficos en un solo lugar
fi: Turvallinen tapa säilyttää kryptovaluttoja
ja: あなたのすべての暗号資産を1か所に保持します
ko: 모든 암호화폐 자산을 한 곳에서 관리하십시오
zh_hans: 支持调用各种数字资产

# a.welcome.onboarding.2
source: Powered by blockchain technology, smart tickets, fraud free
es: Con tecnología de cadena de bloques, tickets inteligentes, sin fraudes
fi: Perustana lohkoketjut ja älykkäät liput
ja: ブロッキチェーン技術、スマート チケットを使用、不正行為なし
ko: 블록체인 기술 기반, 스마트 티켓, 사기 방지
zh_hans: 基于区块链技术，智能门票，杜绝欺诈

# a.welcome.onboarding.3
source: Buy, sell and transfer your favourite tokens
es: Compra, vende y transfiere tus tokens favoritos
fi: Osta, myy ja siirrä rahakkeita (tokens)
ja: お気に入りのトークンを購入、売却、送信
ko: 원하는 토큰을 구매, 판매, 전송하십시오
zh_hans: 买，卖，转让各种token

# a.welcome.onboarding.createwallet.button.title
source: GET STARTED
es: EMPEZAR
fi: ALOITA
ja: 開始
ko: 시작하기
zh_hans: 开始使用

# a.marketplace.tabbar.item.title
source: Marketplace
es: Mercado
fi: Tori
ja: マーケットプレース
ko: 마켓플레이스
zh_hans: 公共市场

# a.claim.token.title
source: Importing %@
es: Importación de %@
fi: Tuodaan %@
zh_hans: 正在导入%@

# a.claim.token.prompt
source: Import Link?
es: ¿Importar enlace?
fi: Tuontilinkki?
ja: インポート リンク?
ko: 가져오기 링크?
zh_hans: 导入链接？

# a.claim.token.success.title
source: Your ticket has been transferred and the balance will be updated shortly
es: Tu ticket se ha transferido y el saldo se actualizará en breve
fi: Toimeksiantosi on lähtetty. Tilin saldo päivittyy hetken kuluttua.
ja: チケットが送信され、残高が間もなく更新されます
ko: 티켓이 전송되었으며 곧 잔고가 업데이트됩니다
zh_hans: 您的门票已转出，余额即将更新

# a.claim.token.failed.title
source: Invalid ticket link
es: Enlace de ticket no válido
fi: Virheellinen toimeksiannon linkki
ja: 無効なチケットのリンク
ko: 잘못된 티켓 링크
zh_hans: 无效门票链接

# a.claim.token.failed.serverDown
source: Paymaster server down, please try again later
es: El servidor de Paymaster está fuera de servicio, inténtalo de nuevo más tarde
fi: Paymaster-palvelu ei ole toiminnassa. Yritä myöhemmin uudelleen
ja: a.claim.token.failed.serverDown
ko: a.claim.token.failed.serverDown
zh_hans: Paymaster 服务器停机，请稍后再试

# a.claim.token.invalidLink.tryAgain
source: Invalid Link, please try again
es: Enlace no válido, inténtalo de nuevo
fi: Virheellinen linkki. Yritän uudelleen
ja: 無効なリンクです。もう一度試してください
ko: 링크가 잘못되었습니다. 다시 시도하십시오
zh_hans: 无效链接，请重试

# a.claim.token.noConnectivity.tryAgain
source: Not connected to the internet, please try again
es: No estás conectado a internet, inténtalo de nuevo
fi: Internet-yhteysvirhe. Yritä uudelleen
ja: インターネットに接続していません。もう一度試してください
ko: 인터넷에 연결되지 않았습니다. 다시 시도하십시오
zh_hans: 未连接到互联网，请重试

# a.claim.token.linkExpired
source: Link has expired
es: El enlace ha expirado
fi: Linkin voimassaolo on päättynyt
zh_hans: 链接已失效

# a.claim.token.linkAlreadyRedeemed
source: Link has already been redeemed
es: El enlace ya ha sido canjeado
fi: Toimeksianto on jo lunastettu
zh_hans: 链接已兑换

# a.claim.token.failed.notEnoughEth.title
source: You do not have enough ETH to import this ticket
es: No tienes suficiente ETH para importar este ticket
fi: Liian vähän ETH-valuuttaa tämän toimeksiannon lunastamiseen
ja: このチケットをインポートするのに十分な ETH がありません
ko: 이 티켓을 가져오는 데 필요한 ETH가 충분하지 않습니다
zh_hans: 以太币不足，无法导入此门票

# a.claim.token.failed.notEnoughXDAI.title
source: You do not have enough xDAI to import this ticket
es: No tienes suficiente xDAI para importar este ticket
fi: Liian vähän xDAI-valuuttaa tämän toimeksiannon lunastamiseen
ja: a.claim.token.failed.notEnoughXDAI.title
ko: a.claim.token.failed.notEnoughXDAI.title
zh_hans: xDAI 不足，无法导入此门票

# a.claim.token.validating.title
source: Processing...
es: Procesando...
fi: Käsitellään...
ja: 処理しています...
ko: 처리 중...
zh_hans: 正在处理...

# a.claim.token.promptImport.title
source: Import?
es: ¿Importar?
fi: Tuo?
ja: インポート?
ko: 가져옵니까?
zh_hans: 是否导入？

# a.claim.token.inProgress.title
source: Importing tickets...
es: Importando tickets...
fi: Toimeksiantoja tuodaan...
ja: チケットをインポートしています...
ko: 티켓을 가져오는 중...
zh_hans: 正在导入门票...

# a.claim.token.import.button.title
source: Import
es: Importar
fi: Tuo
ja: インポート
ko: 가져오기
zh_hans: 导入

# a.claim.token.purchase.button.title
source: Purchase
es: Comprar
fi: Osta
ja: 購入
ko: 구매
zh_hans: 购买

# a.claim.token.ethCostLabel.title
source: Total Cost
es: Coste total
fi: Kokonaiskustannus
ja: 合計費用
ko: 총 비용
zh_hans: 总价

# a.claim.token.ethCost.free.title
source: Free Import
es: Importación gratuita
fi: Ilmainen tuonti
ja: 無料インポート
ko: 무료 가져오기
zh_hans: 免费导入

# a.claim.token.dollarCostLabel.title
source: EQUIVALENT IN USD
es: EQUIVALENTE EN USD
fi: VASTAAVA USD MÄÄRÄ
ja: 米ドルでの相当額
ko: USD 상응 가치
zh_hans: 等值美元

# a.send.receive.button.title
source: Send/Receive
es: Enviar/Recibir
fi: Lähetä/Vastaanota
ja: 送信/受信
ko: 보내기/받기
zh_hans: 发送/接收

# a.send.recipient.address.title
source: ADDRESS
es: DIRECCIÓN
fi: OSOITE
ja: アドレス
ko: 주소
zh_hans: 地址

# a.send.balance.insufficient
source: Insufficient balance
es: Saldo insuficiente
fi: Saldo ei riitä
ja: 残高不足
ko: 잔고 부족
zh_hans: 余额不足

# accounts.confirm.delete.action
source: Lose this Wallet
es: Pérdida de este monedero
fi: Hävitä tämä lompakko
zh_hans: 丢失此钱包

# accounts.confirm.delete.title
source: Are you sure you would like to delete this wallet?
es: ¿Seguro que deseas eliminar este monedero?
fi: Oletko varma, että haluat tuhota tämän lompakon?
ja: このウォレットを削除してもよろしいですか?
ko: 이 지갑을 삭제하시겠습니까?
zh_hans: 是否确定要删除此钱包？

# accounts.confirm.delete.message
source: Make sure you have backup of your wallet.
es: Asegúrate de tener una copia de seguridad de tu monedero.
fi: Varmista, että mahdollinen varmuuskopiosi toimii.
ja: あなたのウォレットのバックアップがあることを確認してください。
ko: 지갑이 백업되어 있는지 확인하십시오.
zh_hans: 请确保您已备份此钱包。

# accounts.confirm.delete.okTitle
source: Delete
es: Eliminar
fi: Hävitä
ja: 削除
ko: 삭제
zh_hans: 删除

# accounts.delete.error.failedToDeleteAccount
source: Failed to delete account
es: Error al eliminar la cuenta
fi: Tilin hävittäminen epäonnistui
ja: アカウントを削除できませんでした
ko: 계정을 삭제하지 못했습니다
zh_hans: 删除帐户失败

# accounts.error.failedToDecryptKey
source: Could not decrypt key with given passphrase
fi: Annettu salasana ei toimi. Avaimen salauksen purku epäonnistui.

# accounts.error.duplicateAccount
source: You already added this address to wallets
fi: Tämä osoite on jo lompakossa

# accounts.error.failedToSignTransaction
source: Failed to sign transaction
fi: Transaktion allekirjoitus epäonnistui

# accounts.error.failedToCreateWallet
source: Failed to create wallet
fi: Lompakon luonti epäonnistui

# accounts.error.failedToImportPrivateKey
source: Failed to import private key
fi: Salaisen avaimen tuonti epäonnistui

# accounts.error.failedToParseJSON
source: Failed to parse key JSON
fi: Avaimen luku JSON-tiedostosta epäonnistui

# accounts.error.accountNotFound
source: Account not found
fi: Tiliä ei löytynyt

# accounts.error.failedToSignMessage
source: Failed to sign message
fi: Viestin allekirjoitus epäonnistui

# accounts.error.failedToExportPrivateKey
source: Failed to export private key
fi: Salaisen avaimen vienti epäonnistui

# accounts.error.failedToExportSeed
source: Failed to export wallet seed. If you have migrated to a new phone or restored your device, you need to import your wallet again
fi: Lompakon siemenluvun vienti epäonnistui. Jos olet vaihtanut puhelintasi tai palauttanut puhelimen asetukset varmuuskopiolta, lompakko pitää palauttaa tuomalla se erilliseltä varmuuskopiolta

source: Chain ID
es: ID de cadena
fi: Ketjun tunniste (Chain ID)
ja: チェーン ID
ko: 체인 ID
zh_hans: 链 ID

source: Endpoint
es: Punto final
fi: Päätepiste (Endpoint)
ja: エンドポイント
ko: 엔드포인트
zh_hans: 端点

# settings.preferences.button.title
source: Show Tokens on Launch
es: Mostrar tokens al iniciar
fi: Näytä rahakkeet käynnistyksen aikana
ja: 起動時にトークンを表示
ko: 시작 시 토큰 표시
zh_hans: 启动时显示通证

# settings.preferences.title
source: Preferences
es: Preferencias
fi: Asetukset
ja: 基本設定
ko: 환경 설정
zh_hans: 偏好设置

source: Balance
es: Saldo
fi: Saldo
ja: 残高
ko: 잔고
zh_hans: 余额

# confirmSignMessage
source: Confirm signing this message:
es: Confirma la firma de este mensaje:
fi: Vahvista viestin allekirjoitus:
ja: このメッセージの署名を確認してください:
ko: 이 메시지에 서명 확인:
zh_hans: 确认签署此消息：

# blockchain.ethereum
source: Ethereum Blockchain
es: Cadena de bloques de Ethereum
fi: Ethereum-lohkoketju
ja: Ethereum ブロックチェーン
ko: 이더리움 블록체인
zh_hans: 基于以太坊智能合约

source: Undefined error
es: Error indefinido
fi: Määrittelemätön virhe
ja: 未定義のエラー
ko: 정의되지 않은 오류
zh_hans: 未定义错误

# unknown.error
source: An unknown error occurred.
es: Se ha producido un error desconocido.
fi: Tuntematon virhe
ja: 不明なエラーが発生しました。
ko: 알 수 없는 오류가 발생했습니다.
zh_hans: 发生未知错误。

source: Coming soon
es: Próximamente
fi: Tuloassa
ja: 近日公開
ko: 향후 예정
zh_hans: 即将推出

# backupPassword.confirmation.mustMatch
source: You must enter the same passsword in Password and Confirm Password
es: Debes introducir la misma contraseña en los campos Contraseña y Confirmar contraseña
fi: Anna sama salasana molemmilla kerroilla
ja: 「パスワード」と「パスワードの確認」に同じパスワードを入力する必要があります
ko: 비밀번호와 비밀번호 확인에 같은 비밀번호를 입력해야 합니다
zh_hans: 您必须在“密码”和“确认密码”栏中输入相同的密码

# camera.qrCode.denied.prompt.title
source: Camera Access Required to Scan QR Code
es: Es necesario el acceso a la cámara para escanear el código QR
fi: Salli kameran käyttö QR-koodiden lukemista varten
ja: QR コードをスキャンするためにカメラへのアクセスが必要です
ko: QR 코드를 스캔하려면 카메라 접근 권한이 필요합니다
zh_hans: 需要相机访问权限，才能扫描二维码

# camera.qrCode.denied.prompt.message
source: Your privacy settings are preventing us from accessing your camera for QR code scanning. Fix this by: 1. Tap the Open Settings button below to open the Settings app. 2. Tap to enable the Camera on. 3. Launch this app again.
es: Tus ajustes de privacidad no nos permiten acceder a la cámara para escanear el código QR. Arréglalo de esta forma: 1. Pulsa en el botón Abrir ajustes de abajo para abrir los Ajustes. 2. Pulsa para activar la Cámara. 3. Vuelve a iniciar esta aplicación.
fi: Tietosuoja-asetukset estävät kameran käyttämisen QR-koodien lukemiseen. Muuta asetuksia: 1. Napauta 'Avaa asetukset' -nappia avataksesi Asetukset. 2. Salli kameran käyttö. 3. Käynnistä tämä sovellus uudelleen.
ja: プライバシー設定により、 QR コードをスキャンするためにカメラにアクセスできません。次の手順に従って、この問題を修正してください: 1. 下の「設定を開く」ボタンをタップして設定アプリを開きます。 2. タップしてカメラを有効にします。 3. このアプリを再起動します。
ko: 현재 개인 정보 보호 설정으로는 QR 코드를 스캔하기 위하여 카메라에 접근할 수 없습니다. 수정 방법: 1. 아래 설정 열기 버튼을 탭하여 설정 앱을 엽니다. 2. 탭하여 카메라를 켬으로 활성화합니다. 3. 이 앱을 다시 실행합니다.
zh_hans: 鉴于您的隐私设置，我们无法访问相机以扫描二维码。请通过以下步骤解决此问题： 1、点击下方的“打开设置”按钮以打开“设置”选项。 2、点击启用相机。 3、再次启动该应用。

# camera.qrCode.denied.prompt.button
source: Open Settings
es: Abrir Ajustes
fi: Avaa Asetukset
ja: 設定を開く
ko: 설정 열기
zh_hans: 打开设置

# openSeaNonFungibleTokens.url.open
source: Open on %@
es: Abrir en %@
fi: Avaa kohdassa %@
ja: %@ で開く
ko: %@에서 열기
zh_hans: 在%@上打开

# address.ens.labelMessage
source: Ethereum address or ENS name
es: Dirección de Ethereum o nombre ENS
fi: Ethereum-osoite tai ENS-nimi
zh_hans: 以太坊地址或ENS名称

# dappBrowser.switchServer
source: Connected to: %@
es: Conectado a: %@
fi: Kytketty verkko: %@
zh_hans: 已连接到： %@

# myDappsButton.imageLabel
source: My Bookmarks
es: Mis marcadores
fi: Kirjanmerkit
zh_hans: 我的书签

# discoverDappsButton.imageLabel
source: Discover Dapps
es: Descubrir DApps
fi: Etsi Dapps-sovelluksia
zh_hans: 发现 DApp

# historyButton.imageLabel
source: My History
es: Mi historial
fi: Selaushistoria
zh_hans: 我的历史记录

# addButton.title
source: Add
es: Añadir
fi: Lisää
zh_hans: 添加

# removeButton.title
source: Remove
es: Eliminar
fi: Poista
zh_hans: 移除

# clearButton.title
source: Clear
es: Borrar
fi: Tyhjennä
zh_hans: 清除

# editButton.title
source: Edit
es: Editar
fi: Muuta
zh_hans: 编辑

# dappBrowser.browserHistory
source: My History
es: Mi historial
fi: Selaushistoria
zh_hans: 我的历史记录

# dappBrowser.clearHistory
source: Clear History?
es: ¿Borrar historial?
fi: Tyhjennä selaushistoria?
zh_hans: 是否清除历史记录？

# dappBrowser.clearHistory.prompt
source: Are you sure you want to clear your history?
es: ¿Seguro que deseas borrar tu historial?
fi: Haluatko varmasti tyhjentää selaushistorian?
zh_hans: 是否确定要清除您的历史记录？

# dappBrowser.myDapps.empty
source: You have no bookmarks displayed yet. Start by surfing the browser.
es: Todavía no tienes ningún marcador que mostrar. Empieza a explorar con el navegador.
fi: Kirjanmerkkejä ei ole. Voit aloittaa selaamalla verkkoa.
zh_hans: 您尚无可显示的书签。请先使用浏览器上网。

# dappBrowser.myDapps.edit
source: Edit Bookmark
es: Editar marcador
fi: Muuta kirjanmerkkiä
zh_hans: 编辑书签

# dappBrowser.myDapps.edit.title.label
source: Title
es: Título
fi: Nimi
zh_hans: 标题

# dappBrowser.myDapps.edit.url.label
source: Address
es: Dirección
fi: URL-osoite
zh_hans: 签署人地址

# dappBrowser.clearMyDapps
source: Remove Bookmark?
es: ¿Eliminar marcador?
fi: Poista kirjanmerkki?
zh_hans: 是否移除书签？

source: Recent Transactions
es: Transacciones recientes
fi: Viimeaikaiset tilitapahtumat
zh_hans: 最近交易

# photos
source: Browse
es: Explorar
fi: Selaa kuvia
ko: Photos
zh_hans: 浏览

source: Light
es: Luz
fi: Valo
zh_hans: 闪光灯

# qrCode.title
source: Point your camera on QR code
es: Apunta la cámara al código QR
fi: Aseta QR-koodi neliöön
zh_hans: 将相机对准二维码

# tokenScript.notSupportedSchema.error
source: Please upgrade AlphaWallet to support this TokenScript file
es: Actualiza AlphaWallet para poder utilizar este archivo de TokenScript
fi: Päivitä AlfaLompakko-sovellus käyttääksesi tätä TokenScript-tiedostoa
zh_hans: 请升级 AlphaWallet 以支持此 TokenScript 文件

# tokenScript.moveFile.error
source: Error moving asset definition file from %@ to: %@: %@
fi: Virhe omaisuuserän määrittelytiedostoa siirrettäessä kohteesta %@ kohteeseen: %@: %@

# TokenScript.verifying
source: Verifying...
es: Verificando...
fi: Tarkistetaan...
zh_hans: 正在验证...

# TokenScript.showErrors
source: Show errors
es: Mostrar errores
fi: Näytä virheet
zh_hans: 显示错误

# TokenScript.type1.supportedAndSigned
source: Verified
es: Verificado
fi: Tarkistettu
zh_hans: 已验证

# TokenScript.type1.supportedNotCanonicalizedAndUnsigned
source: Unsigned
es: Sin firmar
fi: Allekirjoittamaton
zh_hans: 未签名

# TokenScript.type2.conflictingFiles
source: Conflicting TokenScript Files
es: Archivos de TokenScript en conflicto
fi: Ristiriitaiset TokenScript-tiedostot
zh_hans: TokenScript 文件相冲突

# TokenScript.type2.oldSchemaVersion
source: Old TokenScript Version
es: Versión antigua de TokenScript
fi: Vanha TokenScript-versio
zh_hans: 老旧的 TokenScript 版本

# TokenScript.type2.invalidSignature
source: Invalid Signature
es: Firma no válida
fi: Virheellinen allekirjoitus
zh_hans: 无效签名

# gettingStarted.subtitle
source: AlphaWallet
es: Bienvenido a AlphaWallet
fi: AlfaLompakkoon!
ja: Welcome to AlphaWallet
ko: Welcome to AlphaWallet
zh_hans: 欢迎使用 AlphaWallet

# gettingStarted.newWallet
source: Create a new Wallet
es: Crear un monedero nuevo
fi: Luo uusi lompakko
zh_hans: 创建新钱包

# gettingStarted.alreadyHaveWallet
source: I already have a Wallet
es: Ya tengo un monedero:
fi: Minulla on jo Lompakko
zh_hans: 我已经有一个钱包：

# backup.prompt.title
source: Your Wallet is not backed up!
es: ¡No has hecho una copia de seguridad de tu monedero!
fi: Lompakkosi ei ole varmuuskopioitu!
zh_hans: 您的钱包未备份！

# backup.prompt.description.withAmount
source: You have not backed up your wallet yet. You have %@ USD net. Act now.
es: Todavía no has hecho una copia de seguridad de tu monedero. Tienes %@ USD netos. Hazlo ahora.
fi: Et ole vielä varmuuskopioinut lompakkoasi. Sinulla %@ USD lompakossasi. Toimi!
zh_hans: 您尚未备份钱包。您有 %@ 美元的净值，立即备份。

# backup.prompt.backupButton.title
source: Back up Wallet
es: Hacer una copia de seguridad del monedero
fi: Varmuuskopioi
zh_hans: 备份钱包

# backup.prompt.backup.remindLater
source: Remind me to back up later?
es: ¿Recordarme que haga una copia de seguridad más tarde?
fi: Muistuta varmuuskopionnista myöhemmin?
zh_hans: 稍后提醒我备份？

# backup.prompt.afterReceivingEther.title
source: Just received %@ ETH?
es: ¿Acabas de recibir %@ ETH?
fi: Vastaanotit juuri %@ ETH?
zh_hans: 刚刚收到 %@ 以太币？

# backup.prompt.description.withoutAmount
source: Remember to back up your wallet by a secure seed phrase.
es: No te olvides de hacer una copia de seguridad de tu monedero con una frase semilla segura.
fi: Muista varmuuskopioida lompakkosi ottamalla siemenlause (seed phrase) paperille talteen.
zh_hans: 请记得使用安全的助记词来备份您的钱包。

# backup.prompt.afterInterval.title
source: Time to back up your Wallet
es: Es hora de hacer una copia de seguridad de tu monedero
fi: Aika varmuuskopioida lompakkosi!
zh_hans: 是时候备份您的钱包了

# backup.prompt.afterInterval.description
source: We highly recommend to back up your wallet
es: Te recomendamos encarecidamente que hagas una copia de seguridad de tu monedero
fi: Varmuuskopiointi on erittäin suositeltavaa!
zh_hans: 我们强烈建议您备份钱包

# backup.prompt.afterHittingThreshold.title
source: Your Wallet is at risk!
es: ¡Tu monedero está en peligro!
fi: Lompakkosi on vaarassa!
zh_hans: 您的钱包有风险！

# backup.prompt.afterHittingThreshold.description
source: You have not backed up your wallet yet. You have %@ net. Act now.
es: Todavía no has hecho una copia de seguridad de tu monedero. Tienes %@ USD netos. Hazlo ahora.
fi: Et ole vielä varmuuskopioinut lompakkoasi. Sinulla %@ lompakossasi. Toimi!
ja: You have not backed up your wallet yet. You have %@ USD net. Act now.
ko: You have not backed up your wallet yet. You have %@ USD net. Act now.
zh_hans: 您尚未备份钱包。您有 %@ 美元的净值，立即备份。

# onboarding.newWallet.backupWallet.title
source: Back up your Wallet
es: Haz una copia de seguridad de tu monedero
fi: Varmuuskopioi lompakko
zh_hans: 备份您的钱包

# onboarding.newWallet.backupWallet.description
source: Your funds will be at risk if you do not back up before using your wallet
es: Tus fondos estarán en peligro si no haces una copia de seguridad antes de utilizar tu monedero
fi: Varasi ovat vaarassa ellet varmuuskopio lompakkoasi ennen sen käyttöä
zh_hans: 如在未备份的情况下使用钱包，您的资金将面临风险

# keystore.accessKey.nonHd.backup
source: Accessing your wallet key to back it up
es: Accediendo a la clave de tu monedero para hacer una copia de seguridad
fi: Salli pääsy lompakkoosi varmuuskopiointia varten
zh_hans: 正在访问您的钱包密钥以进行备份

# keystore.accessKey.hd.backup
source: Accessing your wallet seed phrase to back it up
es: Accediendo a la frase semilla de tu monedero para hacer una copia de seguridad
fi: Näytä lompakkosi siemenlause (seed phrase) varmuuskopiointia varten
zh_hans: 正在访问您的钱包助记词以进行备份
