Repository: AlphaWallet/alpha-wallet-ios
Catalog: AlphaWallet/Localization/*.lproj/Localizable.strings
Languages: es, fi, ja, ko, zh_hans

# keystore.accessKey.hd.verify
source: Accessing your wallet seed phrase to verify against it
es: Accediendo a la frase semilla de tu monedero para verificarla
fi: Salli lomakkosi siemenlauseen käsittely siemenlauseen varmistukseen
zh_hans: 正在访问您的钱包助记词以进行验证

# keystore.accessKey.hd.prepareToVerify
source: Accessing your wallet seed phrase to let you verify against it
es: Accediendo a la frase semilla de tu monedero para que la verifiques
fi: Näytä lompakkosi siemenlause (seed phrase)
zh_hans: 正在访问您的钱包助记词以便允许您进行验证

# keystore.accessKey.sign
source: Accessing your wallet key to sign
es: Accediendo a la clave de tu monedero para firmar
fi: Salli lompakkosi salaisen avaimen käyttö allekirjoittamiseen
zh_hans: 正在访问您的钱包密钥以进行签名

# keystore.accessKey.needImportOrPasscode
source: Can't access your wallet. If you have migrated to a new phone or restored your device, you need to import your wallet again
es: No es posible acceder a tu monedero. Si has migrado a un teléfono nuevo o has restaurado el dispositivo, tienes que volver a importar el monedero
fi: Pääsy lompakkoon epäonnistui. Jos olet vaihtanut puhelintasi tai palauttanut puhelimen asetukset varmuuskopiolta, lompakko pitää palauttaa tuomalla se erilliseltä varmuuskopiolta.
zh_hans: 无法访问您的钱包。如果您已迁移到新手机或者重置了设备，则需再次导入钱包

# keystore.accessKey.cancelled
source: You have denied access to your wallet
es: Has denegado el acceso a tu monedero
fi: Estit pääsyn lompakkoon
zh_hans: 您已拒绝访问钱包

# keystore.accessKey.lock.fail
source: Can't lock your wallet key. Maybe your iOS Passcode is not enabled?
es: No es posible bloquear la clave de tu monedero. ¿Puede que tu código de iOS no esté activado?
fi: Lompakon avaimen lukitseminen epäonnistui. Oletko estänyt iOS-pääsykoodin käytön?
zh_hans: 无法锁定您的钱包密钥。或许您尚未启用 iOS 密码？

# keystore.accessKey.hd.lock
source: To lock your seed phrase to increase security
es: Para bloquear tu frase semilla y aumentar la seguridad
fi: Parantaaksesi tietoturvaa lukitse siemenlause
zh_hans: 锁定助记词以提高安全性

# keystore.accessKey.nonHd.lock
source: To lock your private key to increase security
es: Para bloquear tu clave privada y aumentar la seguridad
fi: Parantaaksesi tietoturvaa lukitse salainen avain
zh_hans: 锁定私钥以提高安全性

# keystore.lock.wallet.seed.title
source: Lock your Seed Phrase to Increase Security
es: Bloquea tu frase semilla para aumentar la seguridad
fi: Siemenlauseen lukitseminen
zh_hans: 锁定助记词以提高安全性

# keystore.lock.wallet.privateKey.title
source: Lock your Private Key to Increase Security
es: Bloquea tu clave privada para aumentar la seguridad
fi: Salaisen avaimen lukitseminen
zh_hans: 锁定私钥以提高安全性

# keystore.lock.wallet.seed.description
source: AlphaWallet security is being upgraded to the best achievable. Lock your seed phrase with biometrics
es: La seguridad de AlphaWallet se ha mejorado al máximo. Bloquea tu frase semilla mediante biometría
fi: AlfaLompakon tietoturvaa päivitetään parhaaksi mahdolliseksi. Lukitse siemenlause (Seed Phrase) biometrisesti
zh_hans: AlphaWallet 的安全性正在升级为最佳状态。使用生物识别技术锁定您的助记词

# keystore.lock.wallet.privateKey.description
source: AlphaWallet security is being upgraded to the best achievable. Lock your private key with biometrics
es: La seguridad de AlphaWallet se ha mejorado al máximo. Bloquea tu clave privada mediante biometría
fi: AlfaLompakon tietoturvaa päivitetään parhaaksi mahdolliseksi. Lukitse salainen avain biometrisesti
zh_hans: AlphaWallet 的安全性正在升级为最佳状态。使用生物识别技术锁定您的私钥

# keystore.lock.wallet.seed.button
source: Lock Seed Phrase
es: Bloquear frase semilla
fi: Lukitse siemenlause (Seed Phrase)
zh_hans: 锁定助记词

# keystore.lock.wallet.privateKey.button
source: Lock Private Key
es: Bloquear clave privada
fi: Lukitse salainen avain (Private Key)
zh_hans: 锁定私钥

# wallet.security.level.red
source: BACK UP NOW!
es: ¡HAZ UNA COPIA DE SEGURIDAD AHORA!
fi: Tee se nyt!
zh_hans: 马上备份！

# wallet.security.level.orange
source: NOT LOCKED
es: NO BLOQUEADO
fi: Lukitsematon!
zh_hans: 未锁定

# wallet.security.level.green
source: 100% SECURE
es: 100% SEGURO
fi: Turvallinen
zh_hans: 100% 安全

# wallets.showSeedPhrase.subtitle.error
source: Do not share your backup. AlphaWallet team members will not ask for it.
es: No compartas tu copia de seguridad. Los miembros del equipo de AlphaWallet nunca te la pedirán.
fi: Alä jaa varmuuskopiotasi. Sovelluksen tukipalvelu ei koskaan pyydä sitä.
zh_hans: 请勿将备份文件分享给他人。AlphaWallet 团队成员绝不会向您索要备份。

# token.transactionConfirmation.gas.title
source: Speed (Gas)
fi: Prioriteetti (asetettu tapahtuman kulujen taso)

# token.transactionConfirmation.contract.title
source: Contract
fi: Sopimus

# token.transactionConfirmation.function.title
source: Function
fi: Toiminto

# token.transactionConfirmation.default
source: Default
fi: Oletusarvo

# token.transactionConfirmation.network
source: Network
fi: Verkko

# token.transactionTransferConfirmation.title
source: Confirm Transfer?
fi: Vahvista siirto?

# token.transactionPurchaseConfirmation.title
source: Confirm Purchase?
fi: Vahvista osto?

# token.transactionSpeedupConfirmation.title
source: Confirm Transaction?
fi: Vahvista nopeutus?

# token.transactionCancelConfirmation.title
source: Attempt to Cancel
fi: Vahvista peruminen

# token.transactionConfirmation.title
source: Confirm Transaction?
es: Confirm Transfer?
fi: Vahvista tilitapahtuma?
zh_hans: Confirm Transfer?

# token.transactionConfirmation.error.title.insufficientFundsError
source: Not enough %@ to pay for fees
fi: Liian vähän %@ kulujen maksamiseen

# token.transactionConfirmation.error.title.nonceTooLowError
source: Nonce of the Transaction is too low
fi: Tilitapahtuman satunnaistunnus (Nonce) on liian pieni

# token.transactionConfirmation.error.title.gasPriceTooLow
source: Gas Price is too low
fi: Kulujen yksikköhinta (Gas Price) liian pieni

# token.transactionConfirmation.error.title.gasLimitTooLow
source: Gas Limit is too low
fi: Kuluraja (Gas Limit) on liian alhainen

# token.transactionConfirmation.error.title.gasLimitTooHigh
source: Gas Limit is too high
fi: Kuluraja (Gas Limit) on liian korkea

# token.transactionConfirmation.error.description.insufficientFundsError
source: Every transaction requires a small amount of %@ (%@) to pay for the fees. You can receive %@ from a different wallet, crypto exchange, or you can buy %@ using the button below.
fi: Jokainen tilitapahtuma vaatii pienen määrän %@ (%@) tapahtumakuluja varten. Voit vastaanottaa %@ toisesta lompakosta, markkinapaikasta, tai voit napauttaa alla olevaa nappia ostaaksesi %@

# token.transactionConfirmation.error.description.nonceTooLowError
source: The nonce is the total number of transactions which has been sent from this wallet so far, and is included for security purposes. We recommend to leave the nonce empty. We'll fill it for you.
fi: Satunnaistunnus (Nonce) pitää olla suurempi kuin tästä lompakosta lähtettyjen tilitapahtumien lukumäärä. Suosittelemme satunnaistunnus-kentän jättämistä tyhjäksi. Sovellus täyttää sen automaattisest.

# token.transactionConfirmation.error.description.gasPriceTooLow
source: The gas price specified for this transaction is too low. AlphaWallet is using a live oracle and updates the gas price every 15 seconds. We recommend you to choose preselected amount (Slow, Average, Fast).
fi: Asetettu kulujen yksikköhinta (Gas Price) on liian pieni. AlfaLompakko hakee suositellun yksikköhinnan 15 sekunnin välein. Suosittelemme, että valitset jonkin sovelluksen laskemista prioriteettihinnoista (hidas, keskimääräinen, nopea).

# token.transactionConfirmation.error.description.gasLimitTooLow
source: The gas limit specified for this transaction is too low. AlphaWallet is using a live oracle and updates the gas price every 15 seconds. We recommend you to choose preselected amount (Slow, Average, Fast).
fi: Asetettu kuluraja on liian alhainen. Suosittelemme, että valitset jonkin sovelluksen laskemista prioriteettirajoista (hidas, keskimääräinen, nopea).

# token.transactionConfirmation.error.description.gasLimitTooHigh
source: The gas price specified for this transaction is too high. AlphaWallet is using a live oracle and updates the gas price every 15 seconds. We recommend you to choose preselected amount (Slow, Average, Fast).
fi: Asetettu kuluraja on liian korkea. Suosittelemme, että valitset jonkin sovelluksen laskemista prioriteettirajoista (hidas, keskimääräinen, nopea).

# token.transactionConfirmation.error.description.possibleChainIdMismatchError
source: You might be sending this transaction on the wrong chain.
fi: Lohkoketjujen identiteetit eivät vastaa toisiaan. Oletko lähettämässä tämän tilitapahtuman väärään lohkoketjuun?

# token.transactionConfirmation.error.description.executionRevertedError
source: It looks like you are trying to run a smart contract and the logic of that smart contract returns an error.
fi: Näyttää siltä, että yrität suorittaa älysopimustoiminnon, joka palauttaa virheen.

# token.transactionConfirmation.error.rectifyButtonTitle.insufficientFundsError
source: Buy %@
fi: Osta %@

# token.transactionConfirmation.error.rectifyButtonTitle.nonceTooLowError
source: Correct Nonce
fi: Korjaa satunnaistunnus (Nonce)

# token.transactionConfirmation.error.rectifyButtonTitle.gasPriceTooLow
source: Set Speed
fi: Aseta nopeus oikein

# token.transactionConfirmation.error.rectifyButtonTitle.gasLimitTooLow
source: Set Speed
fi: Aseta nopeus oikein

# token.transactionConfirmation.error.rectifyButtonTitle.gasLimitTooHigh
source: Set Speed
fi: Aseta nopeus oikein

# token.transactionConfirmation.error.linkTitle.insufficientFundsError
source: Learn more about Gas fees
fi: Lue lisää kuljen yksikköhinnasta (Gas Fee)

# token.transactionConfirmation.error.linkTitle.nonceTooLowError
source: Learn more about Nonce
fi: Lue lisää satunnaistunnuksesta (Nonce)

# token.transactionConfirmation.error.linkTitle.gasPriceTooLow
source: Learn more about Gas Price
fi: Lue lisää kulujen hinnan muodostuksesta (Gas Price)

# token.transactionConfirmation.error.linkTitle.gasLimitTooLow
source: Learn more about Gas Limit
fi: Lue lisää kulurajasta (Gas Limit)

# token.transactionConfirmation.error.linkTitle.gasLimitTooHigh
source: Learn more about Gas Limit
fi: Lue lisää kulurajasta (Gas Limit)

# a.wallet.token.transaction.inProgress.title
source: Transaction in Progress
fi: Tilitapahtuma käynnissä

# a.wallet.token.transaction.inProgress.subtitle
source: The transaction is sent to the %@. It might take few minutes to be confirmed by miners.
es: The transaction is sent to the Ethereum blockchain. It might take few minutes to be confirmed by miners.
fi: Tilitapahtuma on lähtetty lohkoketjuun. Sen vahvistaminen voi kestää muutamia minuutteja.
zh_hans: The transaction is sent to the Ethereum blockchain. It might take few minutes to be confirmed by miners.

# a.wallet.token.transaction.inProgress.confirm
source: OK, great!
fi: OK!

# a.wallet.token.swap.button.title
source: Swap
fi: Vaihda

# a.wallet.token.xDaiBridge.button.title
source: Convert to DAI
fi: Muunna valuutaksi DAI

# a.wallet.token.arbitrumBridge.button.title
source: Convert to Arbitrum
fi: Muunna valuutaksi Arbitrum

# a.wallet.token.buy.xDai.title
source: Buy xDai
fi: Osta xDai

# buyCrypto.title
source: Buy Crypto
fi: Osta kryptovaluuttoja

# a.wallet.token.buy.title
source: Buy
fi: Osta

# qrCode.myqrCode.title
source: My QR Code
fi: Tämän lompakon QR-koodi

# qrCode.sendToAddress.title
source: Send to this Address
fi: Lähteä tähän osoitteeseen

# qrCode.watchWallet.title
source: Watch Wallet
fi: Seurattava lompakko

# qrCode.addCustomToken.title
source: Add Custom Token
fi: Lisää uusi rahaketyyppi

# qrCode.openInBrowser.title
source: Open in Browser
fi: Avaa selaimessa

# qrCode.openInEtherscan.title
source: Open in Etherscan
fi: Avaa Etherscan-palvelussa

# assets.selectAsset.title
source: Select Asset
fi: Valitse omaisuuserä

# activity.from
source: from %@
fi: osoitteesta %@

# activity.to
source: to %@
fi: osoitteeseen %@

# activity.approvalObtained
source: Gave approval to move %@
fi: Siirto hyväksytty: %@

# activity.ownerApproved
source: Approved to move %@
fi: Omistan hyväksymä: %@

# activity.ownerApproved.pending
source: Approving to move %@
fi: Omistajan hyväksyntää odotetaan: %@

# activity.ownerApproved.failed
source: Failed to Approve to move %@
fi: Omistajan hyväksyntää ei saatu: %@

# activity.approve.amount.all
source: All %@
fi: Kaikki %@

# activity.send.pending
source: Sending %@
fi: Lähtetään %@

# activity.send.failed
source: Failed to Send %@
fi: %@ lähetys epäonnistu

# activity.goToToken
source: Go to Token
fi: Mene rahakkeeseen

# activity.speedup
source: Speed up
fi: Nopeuta

# activity.cancel
source: Cancel
fi: Peru

# activity.speedup.description
source: Note that speeding up this transaction does not guarantee your original transaction will be accelerated. If your attempt is successful, you will be charged the miner fee as above.
fi: Huom! Tilitapahtuman nopeuttaminen ei takaa, etta alkuperäinen tilitapahtuma vahvistetaan nopeammin. Jos nopeuttaminen onnistuu, yllä olevat kulut veloitetaan.

# activity.cancel.description
source: Note that speeding up this transaction does not guarantee your original transaction will be cancelled. If your attempt is successful, you will be charged the miner fee as above.
fi: Huom! Tilitapahtuman peruminen ei takaa, että alkuperäinen tilitapahtuma perutaan. Jos peruminen onnistuu, yllä olevat kulut veloitetaan.

# activity.empty
source: Activities will appear here
fi: Tapahtumat näkyvät täällä

# activity.groupTransaction.swap
source: Swap
fi: Vaihda

# activity.groupTransaction.unknown
source: Contract Execution
fi: Sopimuksen suoritus

# configureTransaction.error.gasPriceTooLow
source: Gas Price must be a positive number
fi: Kulujen yksikköhinnan (Gas Price) tulee olla positiivinen kokonaisluku

# configureTransaction.error.leaveNonceEmpty
source: Leave the nonce empty. We'll fill it in for you
fi: Jätä satunnaistunnus (Nonce) tyhjäksi. Sovellus täyttää sen automaattissti.

# configureTransaction.navigationBar.title
source: Set Speed
fi: Aseta prioriteetti

# configureTransaction.header.gasPrice
source: Gas Price
fi: Tapahtumamaksu

# configureTransaction.header.gasLimit
source: Gas Limit
fi: Tapahtumamaksun yläraja

# sendTransaction.error.possibleBinanceTestnetTimeout
source: Request has timed out. Please try again
fi: Aikaraja ylittyi. Yritä uudelleen.

# sendTransaction.error.rateLimited
source: There might have been too many requests. Please try again later
fi: Verkon kuormitus on liian suuri. Yritä myöhemmin uudelleen.

# sendTransaction.error.networkConnectionWasLost
source: The network connection was lost. Please try again
fi: Verkkoyhteys ei toimi. Yritä uudelleen.

# sendTransaction.error.invalidCertificate
source: It seems like there is a problem with the RPC node certificate. Please try again later
fi: RPC-palvelun sertifikaatin kanssa on ongelma. Yritä myöhemmin uudelleen.

# sendTransaction.error.requestTimedOut
source: Request has timed out. Please try again
fi: Aikaraja ylittyi. Yritä myöhemmin uudelleen.

# transactionConfiguration.Type.slow
source: Slow
fi: Hidas

# transactionConfiguration.Type.average
source: Average
fi: Keskimääräinen

# transactionConfiguration.Type.fast
source: Fast
fi: Nopea

# transactionConfiguration.Type.rapid
source: Rapid
fi: Pika

# transactionConfiguration.gasPrice.tooHigh.short
source: High Price
fi: Korkea kulujen yksikköhinta

# transactionConfiguration.gasPrice.tooLow.short
source: Low Price
fi: Matala kulujen yksikköhinta

# transactionConfiguration.gasPrice.tooHigh.long
source: High Gas Price Warning!
fi: Varo! Korkea kulujen yksikköhinta

# transactionConfiguration.gasPrice.tooLow.long
source: Gas Price Might Be Too Low
fi: Varo! Matala kulujen yksikköhinta

# transactionConfiguration.gasPrice.tooHigh.description
source: You set a really high gas price. Please make sure this is not a mistake
fi: Kulujen yksikköhinta on todella korkea. Onko se oikein?

# transactionConfiguration.gasPrice.tooLow.description
source: Gas price is set below the 'slow' speed. Your transaction may take a long time to be written or may never be written.
fi: Kulujen yksikköhinta on alle 'hidas'-prioriteein arvion. Tilitapahtuma voi viedä todella pitkän ajan tai jäädä vahvistamatta.

# transactionConfiguration.gasPrice.congested.description
source: The %@ network is very congested now. Fees might be higher than usual.
fi: %@ on kuormitettu. Kulut voivat olla tavallista suuremmat.

# transactionConfirmation.Row.title.wallet
source: Wallet Address
fi: Lompakon osoite

# transactionConfirmation.Send.Section.Gas.title
source: Gas
fi: Kulut

# transactionConfirmation.Send.Section.Balance.title
source: Balance
fi: Saldo

# transactionConfirmation.Send.Section.Balance.new.title
source: (New: %@)
fi: (Uusi saldo: %@ %@)

# transactionConfirmation.Send.Section.Amount.title
source: Amount
fi: Summa

# transactionConfirmation.Send.Section.Recipient.title
source: Recipient
fi: Vastaanottaja

# transactionConfirmation.Send.Section.TokenId.title
source: Token
fi: Rahake

# transactionConfirmation.authorisation.reason
source: Authorize to confirm transaction
fi: Aktorisoi vahvistaaksesi tilitapahtuman

# transactionConfirmation.keystore.accessKey.sign
source: Accessing to perform transfer
fi: Salaista avainta käsitellään siirron suorittamiseksi

# transactionConfirmation.fee.footerText
source: The higher the fee, the better chances and faster your transaction will go through. Fees are based on current %@ network load.
fi: Mitä korkeampi kulujen yksikköhinta (Gas Fee) on, sitä suuremmalla todennäköisyydellä tilitapahtumasi vahvistetaan nopeasti. Sovelluksen arvioimat yksikköhinnat perustuvat lohkoketjun ajantasaiseen kuormitustietoon.

# walletConnect.statusPlaceholder
source: Status
fi: Tila

# walletConnect.dapp.name
source: Name
fi: Nimi

# walletConnect.dapp.website
source: Website
fi: Nettisivu

# walletConnect.session.connect
source: Connect on %@
fi: Kytkeydy verkkoon %@

# walletConnect.session.connectedURL
source: Connected to
fi: Kytketty verkkoon

# walletConnect.session.disconnect
source: Disconnect
fi: Irrota

# walletConnect.session.switchNetwork
source: Switch Network
fi: Vaihda varkkoa

# walletConnect.session.signedTransactions
source: Signed Transactions
fi: Allekirjoitetut tapahtumat

# walletConnect.start
source: %@ Start WalletConnect session on:
fi: %@ Aloita WalletConnect-kytkentä verkossa:

# walletConnect.failure.title
source: WalletConnect Error
fi: WalletConnect-kytkentävirhe

# walletConnect.sendRawTransaction.title
source: Send raw transaction
fi: Lähetä raaka (raw) tilitapahtuma

# walletConnect.activeSessions
source: Active connection to Dapps
fi: Kytkentä Dapps-sovellukseen

# walletConnect.activeSessions.plural
source: Active connections to Dapps
fi: Kytkennät Dapps-sovelluksiin

# walletConnect.connection.title
source: Connect To Site?
fi: Kytkeydy osoitteeseen?

# walletConnect.connection.name.title
source: Name
fi: Nimi

# walletConnect.connection.network.title
source: Network
fi: Verkko

# walletConnect.connection.networks.title
source: Networks
fi: Verkot

# walletConnect.connection.methods.title
source: Methods
fi: Metodit

# walletConnect.connection.url.title
source: Connected To
fi: Kytketyn verkon URL

# send.allFunds
source: All Funds
fi: Kaikki varat

source: Copied to clipboard
fi: Kopioitu leikekirjaan

# signature.confirmation.message.title
source: Message
fi: Viesti

# signature.confirmation.personalmessage.title
source: Personal message
fi: Henkilökohtainen viesti

# signature.confirmation.title
source: Signature Request
fi: Allekirjoituspyyntö

# server.warning.serverIsDisabled
source: %@ is disabled
fi: %@ on kytketty pois. Kytke päälle kohdassa Asetukset > Kytketyt verkot

# server.warning.serversAreDisabled
source: %@ are disabled
fi: %@ on kytketty pois. Kytke päälle kohdassa Asetukset > Kytketyt verkot

# settings.wallet.rename
source: Name this Wallet
fi: Nimeä lompakko

# wallet.rename.save
source: Save Name
fi: Tallenna

# wallet.rename.enterNameTitle
source: Enter Name
fi: Uusi nimi

# wallets.hideToken.error.AddTokenFailure
source: Add token failure
fi: Rahakkeen lisääminen epäonnistui

# addCustomChain.unnamed
source: Unnamed
fi: Nimetön

# addCustomChain.error.invalidChainId
source: Invalid chain ID provided: %@
fi: Ketjun tunniste (Chain ID) on virheellinen: %@

# addCustomChain.error.noRpcNodeUrl
source: No RPC node URL provided
fi: RPC-palvelimen URL-osoitetta ei ole annettu

# addCustomChain.error.noBlockchainExplorerUrl
source: No blockchain explorer URL provided
fi: Lohkoselaimen URL-osoitetta ei ole annettu

# addCustomChain.error.invalidBlockchainExplorerUrl
source: Invalid blockchain explorer URL
fi: Virheellinen lohkoselaimen URL-osoite

# addCustomChain.switchToExisting
source: This site is requesting you to switch to the %@ chain with chain ID: %ld. This will reload the page.
fi: Sivusto pyytää kytkeytymistä lohkoketjuun %@, jonka tunniste (Chain ID) on %ld. Tämä lataa sivu uudelleen.

# addCustomChain.enableExisting
source: This site is requesting you to enable and switch to the %@ chain with chain ID: %ld. This will reload the page.
fi: Sivusto pyytää kytkeytymistä lohkoketjuun %@, jonka tunniste (Chain ID) on %ld. Lohkoketju kytketään käyttöön. Tämä lataa sivun uudelleen.

# addCustomChain.addAndSwitch
source: This site is requesting you to add and switch to the %@ chain with chain ID: %ld. This will reload the page.
fi: Sivusto pyytää kytkeytymistä lohkoketjuun %@, jonka tunniste (Chain ID) on %ld. Lohkoketju lisätään. Tämä lataa sivun uudelleen.

# addCustomChain.error.unknown
source: Unknown Error
fi: Tuntematon virhe

# addCustomChain.error.chainIdNotMatch
source: Chain IDs returned by the RPC server do not match: %@ vs. %@
fi: RPC-palveimen palauttama tunniste (Chain ID) ei vastaa haluttua: %@ vs. %@

# addCustomChain.warning.noBlockchainExplorerUrl
source: Blockchain explorer URL can't be resolved. Would you like to continue without it? Transaction history will not be fetched
fi: Annettu lohkoselaimen URL-osoite ei toimi. Haluatko jatkaa? Vanhoja tilitapahtumia ei voida hakea.

# switchChain.error.invalidChainId
source: Invalid chain ID provided: %@
fi: Ketjun tunniste (Chain ID) on virheellinen: %@

# switchChain.error.notSupportedChainId
source: Chain ID is not supported: %@
fi: Ketjun tunniste (Chain ID) ei ole tuettu: %@

# addrpcServer.navigation.title
source: Add Custom RPC Network
fi: Lisää mukautettu RPC-verkko

# addrpcServer.saveButton.title
source: Add Network
fi: Lisää verkko

# addrpcServer.networkName.title
source: Network Name
fi: Verkon nimi

# addrpcServer.rpcUrl.title
source: RPC URL
fi: RPC URL-osoite

# addrpcServer.blockExplorerUrl.title
source: Block Explorer URL
fi: Lohkoselaimen URL-osoite (Block Explorer URL)

# addrpcServer.isTestnet.title
source: This is Testnet Network
fi: Tämä on testiverkko

# addrpcServer.networkName.error
source: Network Name is invalid
fi: Verkon nimi on virheellinen

# addrpcServer.rpcUrl.error
source: RPC URL is invalid
fi: RPC URL-osoite on virheellinen

# addrpcServer.chainID.error
source: Chain ID is invalid
fi: Ketjun tunniste (Chain ID) on virheellinen

# addrpcServer.symbol.error
source: Symbol is invalid
fi: Symboli on virheellinen

# addrpcServer.blockExplorerUrl.error
source: Block Explorer URL is invalid
fi: Lohkoselaimen URL-osoite on virhellinen

# addrpcServer.chainIdAlreadySupported
source: Already supported. Enable this server instead
fi: Lohkoketju on jo tuettu. Älä yritä lisätä itse vaan kytke käyttöön.

# addrpcServer.rpcUrl.placeholder
source: New RPC Network
fi: Lisättävä RPC-verkko

# addrpcServer.blockExplorerUrl.placeholder
source: Block Explorer
fi: Lohkoselaimen URL-osoite

# editCustomRPC.navigation.title
source: Edit Custom RPC Network
fi: Muuta mukautetun RPC-verkon määrityksiä
