Repository: AlphaWallet/alpha-wallet-ios
Catalog: AlphaWallet/Localization/*.lproj/Localizable.strings
Languages: es, fi, ja, ko, zh_hans

# editCustomRPC.saveButton.title
source: Save Network
fi: Talleta muutokset

# editCustomRPC.chainID.error.duplicate
source: Chain ID already exists
fi: Ketjun tunniste (Chain ID) on jo olemassa

# customRPC.overall.tab.browse
source: Browse
fi: Selaa

# customRPC.overall.tab.manual
source: Enter
fi: Siirry

# customRPC.browse.search.placeholder
source: Search for Network
fi: Etsi verkkoa

# emailList.prompt.title
source: Stay Updated
fi: Tilaa uutiset

# emailList.prompt.message
source: We send an email announcing major features. Would you like to receive such emails? (max 1 email per week)
fi: Lähetämme sähköpostia, kun esittelemme uusia ominaisuuksia. Haluatko liittyä sähköpostilistallemme? (Korkeintaan 1 sähköposti viikossa)

# emailList.prompt.subscribeButtonTitle
source: I want to receive such emails
fi: Liity sähköpostilistalle

# emailList.prompt.email.placeholder
source: Email
fi: Sähköposti

# wallet.summary.today
source: %@ Today
fi: %@ tänään

# token.tab.info
source: Info
fi: Yleisnäkymä

# token.tab.activity
source: Activity
fi: Tapahtumat

# token.info.header.performance
source: Performance
fi: Suorituskyky

# token.info.header.stats
source: Stats
fi: Tilastot

# token.info.field.stats.day
source: 1 Day
fi: 1 päivä

# token.info.field.stats.week
source: 1 Week
fi: 1 viikko

# token.info.field.stats.month
source: 1 Month
fi: 1 kuukausi

# token.info.field.stats.year
source: 1 Year
fi: 1 vuosi

# token.info.field.stats.market_cap
source: Market Cap
fi: Markkinarvo (Market Cap)

# token.info.field.stats.total_supply
source: Total Supply
fi: Tarjonta (Total Supply)

# token.info.field.stats.max_supply
source: Max Supply
fi: Maksimitarjonta (Max Supply)

# token.info.field.performance.year.low
source: 1 Year Low
fi: Vuoden alhaisin

# token.info.field.performance.year.high
source: 1 Year High
fi: Vuoden korkein

# addCustomToken.title
source: Add Custom Token
fi: Lisää rahake

# seachToken.noresults.title
source: No results for token you are searching for
fi: Haku ei löytänyt etsimääsi rahaketta

# sortTokens.param.nameAscending
source: Name: Ascending
fi: Nimet: Aakkosjärjestyksessä

# sortTokens.param.valueAscending
source: Value: Ascending
fi: Arvo: Pienimmästä suurimpaan

# sortTokens.param.nameDescending
source: Name: Descending
fi: Nimet: Käänteisessä aakkosjärjestyksessä

# sortTokens.param.valueDescending
source: Value: Descending
fi: Arvo: Suurimmasta pienimpään

# sortTokens.param.mostUsed
source: Most Used
fi: Eniten käytetty

# sortTokens.sortBy
source: Sort: By %@
fi: Lajittelu: %@

# switchChainRequest.title
source: Switch Chain Request
fi: Lohkoketjun vaihtopyyntö

# switchChainRequest.action.enableSwitchReload
source: Enable, Switch & Reload
fi: Kytke käyttöön, kytkeydy ja lataa sivu uudelleen

# switchChainRequest.action.switchReload
source: Switch & Reload
fi: Kytkeydy ketjuun ja lataa sivu uudelleen

# switchChainRequest.action.addSwitchReload
source: Add, Switch & Reload %@
fi: Lisää ketju, kytkeydy siihen ja lataa sivu %@ uudelleen

# semifungibles.assetsCount
source: %d Assets
fi: %d omaisuuserää

# semifungibles.details
source: Details
fi: Yksityiskohdat

# semifungibles.description
source: Description
fi: Kuvaus

# semifungibles.attributes
source: Properties
fi: Ominaisuudet

# semifungibles.rankings
source: Rankings
fi: Sijoitukset

# semifungibles.stats
source: Stats
fi: Tilastot

# semifungibles.selectedTokens
source: Selected Tokens
fi: Valitut rahakkeet

# semifungibles.createdDate
source: Created
fi: Luontipäivä

# semifungibles.value
source: Value
fi: Arvo

# url.telegramCustomer
source: Telegram (Customer Support)
fi: Telegram (tuotetuki)

# url.faq
source: faq
fi: UKK (FAQ)

# url.github
source: Github (File an issue)
fi: Github (raportoi ohjelmistovirheestä)

# walletConnect.sessions.empty
source: No active WalletConnect sessions
fi: WalletConnect-kytkentöjä ei ole yhtään käytössä

# walletConnect.sessions.scanQrCode
source: Scan QR Code
fi: Lue QR-koodi

# priceAlert.emptyList
source: Alerts will appear here
fi: Hälytykset löytyvät täältä

# priceAlert.navigationTitle
source: Alerts
fi: Hälytykset

# priceAlert.newAlert
source: Add New Price Alert
fi: Aseta uusi hintahälytys

# walletConnect.error.connectionTimeout.title
source: Try WalletConnect again
fi: Aikaraja ylittyi. Yritä uudestaan

# walletConnect.error.connectionTimeout.errorMessage
source: You tried to connect with WalletConnect. Well.. It takes too long. Please generate a fresh QR code and try again.
fi: Yritit kytkeä WalletConnect-toiminnolla. Valitettavasti tämä kesti liian pitkään. Luo uusi QR-koodi ja yritä uudestaan.

# walletConnect.scanQRCodeAgain
source: Scan QR Code again
fi: Lue QR-koodi uudestaan

# donate.shortcuts.walletQrCode
source: Show Wallet QR Code
fi: Näytä lompakon QR-koodi

source: What’s new?
fi: Mitä uutta?

# token.testnetWarning
source: Ropsten tokens are like ‘Monopoly’ money. They have zero financial worth but are used by developers to try out new designs without needing to spend valuable coins.
fi: Ropsten-rahakkeet eivät ole vaihdettavissa keskuspankkirahaan. Niiden rahallinen arvo on nolla. Sovelluskehittäjät käyttävät niitä testatakseen uusia asioita ilman, että heidän täytyy käyttää 'oikeita' Ethereum-rahakkeita.

# token.value.testnetWarning
source: No Value, made for tests only
fi: Ei arvoa, luotu testaustarkoituksiin

# whereAreMyTokens.title
source: Where are my Tokens?
fi: Missä rahakkeeni ovat?

# whereAreMyTokens.description
source: Don’t worry. Your tokens are safe. You are viewing Testnet networks. They are used by developers to try out new designs. You can switch to Mainnet any time.
fi: Tuotantoverkon rahakkeesi ovat tallessa. Olet aktivoinut testiverkot (Testnet). Sovelluskehittäjät käyttävät testiverkon rahakkeita uusien asioiden testaukseen. Voit vaihtaa takaisin tuotantoverkkoihin (Mainnet) milloin vain, niin että tuotantoverkon rahakkeesi tulevat takaisin näkyviin.

# whereAreMyTokens.action
source: Switch to Mainnet
fi: Aktivoi tuotantoverkot

# whereAreMyTokens.testnet
source: Testnet
fi: Testi

# whereAreMyTokens.whereAreMyTokens
source: Where are my tokens?
fi: Missä rahakkeeni ovat?

# tokens.searchbar.placeholder
source: Search for a token
fi: Etsittävä rahake

# a.wallet.token.selectTokens
source: Select
fi: Valitse

# semifungibles.assets.title
source: Assets
fi: Omaisuuserät

# semifungibles.selectedTokens.2
source: %@ Selected
fi: %@ valittu

# semifungibles.selection.selectAll
source: Select All
fi: Kaikki valittu

# semifungibles.toolbar.selectAll
source: Select All
fi: Valitse kaikki

# semifungibles.toolbar.clear
source: Clear
fi: Pyyhi

# semifungibles.toolbar.send
source: Send
fi: Lähetä

# semifungibles.toolbar.sell
source: Sell
fi: Myy

# semifungibles.toolbar.deal
source: Deal
fi: Sovi (Deal)

# semifungibles.attribute.supplyType
source: Supply Type
fi: Tarjonnan tyyppi

# semifungibles.attribute.transferable
source: Transferable
fi: Siirrettävä

# semifungibles.attribute.melt
source: Melt
fi: Sulata (Melt)

# semifungibles.attribute.meltFeeRatio
source: Melt Fee Ratio
fi: Sulatuskulusuhde (Melt Fee Ratio)

# semifungibles.attribute.meltFeeMaxRatio
source: Melt Fee Max Ratio
fi: Sulatuskulusuhteen maksimi (Melt Fee Max Ratio)

# semifungibles.attribute.totalSupply
source: Total Supply
fi: Kokonaistarjonta (Total supply)

# semifungibles.attribute.circulatingSupply
source: Circulating Supply
fi: Käytössä oleva tarjonta (Circulating supply)

# semifungibles.attribute.reserve
source: Reserve
fi: Varaa

# semifungibles.attribute.nonFungible
source: Non Fungible
fi: Ei-vaihdettava (Non Fungible)

# semifungibles.attribute.availableToMint
source: Available To Mint
fi: Lyötävissä

# semifungibles.attribute.issuer
source: Issuer
fi: Liikkeellelaskija

# semifungibles.attribute.transferFee
source: Transfer Fee
fi: Tapahtumakulu

# search.network.result.empty
source: No results for network you are searching for
fi: Etsimääsi verkkoa ei löytynyt

# add.multiple.customRpc.title
source: Saving
fi: Tallettaa

# add.multiple.customRpc.error
source: Failed to add chains.
fi: Ketjuun lisääminen epäonnistui.

# add.multiple.customRpc.added
source: %@ entries added.
fi: Lisätty %@ merkintää.

# add.multiple.customRpc.failed
source: %@ entries failed to add.
fi: %@ merkintää epäonnoistui.

# add.multiple.customRpc.duplicates
source: %@ duplicate entries not added.
fi: %@ duplikaattimerkintää jätettiin tekemättä.

# add.multiple.customRpc.removed
source: These entries have been temporarily removed.
fi: Nämä merkinnät on väliaikaisesti poistettu.

# tokens.wallet.renameThisWallet
source: Rename This Wallet
fi: Nimeä lompakko uudelleen

# emptyTableView.wallet.title
source: You don't have any %@ yet
fi: Lompakossa ei ole vielä yhtään rahaketta tyyppiä %@

# emptyTableView.search.title
source: No results
fi: Ei tuloksia

# emptyTableView.all.title
source: Items
fi: Kohteet

# analytics.navigationTitle
source: Analytics
fi: Analytiikka

# analytics.description
source: Help us to improve AlphaWallet by sharing anonymous data with us. This does not include any financial information.
fi: Auta meitä kehittämään AlfaLompakkoa jakamalla anonymisoidut käyttötietosi. Jaettu käyttötieto ei sisällä mitään taloudellisia tietoja.

# analytics.shareAnonymousData
source: Share Anonymous Data?
fi: Jaa anynymisoidut käyttötiedot?

# email.not.configured
source: Your device isn't configured to send email
fi: Tämän laitteen sähköpostin lähetysasetuksia ei ole määritelty.

# app.device.jailbreak.description
source: Any 'jailbreak' app can access AlphaWallet's keychain data and steal your wallet! Wipe this wallet immediately and restore on a secure device.
es: Cualquier aplicación con "jailbreak" puede acceder a los datos de la cadena de claves de AlphaWallet ¡y robar tu monedero! Borra este monedero inmediatamente y restáuralo en un dispositivo seguro.
ja: あらゆる脱獄アプリは AlphaWallet のキーチェーン データにアクセスしてデータを盗むことができます! このウォレットを直ちにワイプして安全なデバイスに復元してください。
ko: '탈옥' 앱은 AlphaWallet의 키체인 데이터에 접근에서 지갑을 훔칠 수 있습니다! 이 지갑을 즉시 삭제하고 안전한 장치에서 복원하십시오.
zh_hans: 任何已越狱应用都可访问 AlphaWallet 的密匙数据并窃取您的数字财产！请立即在此设备上删除钱包并在安全设备上恢复您的钱包。

source: OK
ko: 확인
zh_hans: 确定

# settings.enabledNetworks.button.title
source: Enabled Networks %@
es: Redes activadas
zh_hans: 已启用网络

# detecting.serverAutomatically.buttonTitle
source: Auto
zh_hans: 自动

# kat.lowercase
source: cryptokitties
zh_hans: 加密猫

# kat.titlecase
source: Cryptokitty
es: Cryptokitties
ja: Cryptokitties
ko: Cryptokitties
zh_hans: 加密猫

# a.wallet.token.debugContract
source: DEBUG
es: DEPURAR
zh_hans: 调试

# a.wallet.token.sell.confirm.multipleTokenSelected.title
source: %d %@
zh_hans: %d 个%@

# a.help.contact.email.subject
source: Help/Feedback for AlphaWallet
es: Ayuda/Comentarios de AlphaWallet
ja: AlphaWallet のヘルプ/フィードバック
ko: AlphaWallet 전용 도움말/피드백
zh_hans: AlphaWallet 的帮助/反馈

# a.help.contact.email.helpfulToDevelopers
source: Helpful information to developers:
es: Información útil para desarrolladores:
ja: 開発者に役立つ情報:
ko: 개발자에게 유용한 정보:
zh_hans: 对开发人员有用的信息：

# a.help.contact.email.iosVersion
source: iOS Version: %@
es: Versión de iOS: %@
ja: iOS バージョン: %@
ko: iOS 버전: %@
zh_hans: iOS 版本： %@

# a.help.contact.email.deviceModel
source: Device Model: %@
es: Modelo del dispositivo: %@
ja: デバイスのモデル: %@
ko: 장치 모델: %@
zh_hans: 设备型号： %@

# a.help.contact.email.appVersion
source: App Version: %@
es: Versión de la aplicación: %@
ja: アプリのバージョン: %@
ko: 앱 버전: %@
zh_hans: 应用版本： %@

# a.help.contact.email.locale
source: Current locale: %@
es: Ubicación actual: %@
ja: 現在のロケール: %@
ko: 현재 로캘: %@
zh_hans: 当前语言环境： %@

# a.help.contents.whatIsETH
source: What is ETH/Ethereum?
es: ¿Qué es el ETH/Ethereum?
ja: ETH/Ethereum とは何ですか?
ko: ETH/이더리움은 무엇입니까?
zh_hans: 以太币/以太坊是什么?

# blockchain.XDAI
source: xDAI Chain
es: Cadena xDAI
zh_hans: xDAI 链

# blockchain.Binance
source: Binance (BSC) Network
es: Binance Network
zh_hans: Binance Network

# blockchain.Binance.test
source: Binance (BSC) Testnet Network
zh_hans: Binance Testnet Network

# a.wallet.token.erc20ExchangeOnUniswap.button.title
source: Swap using Uniswap
es: Exchange with Uniswap
zh_hans: Exchange with Uniswap
