Repository: AlphaWallet/alpha-wallet-ios
Catalog: AlphaWallet/Localization/*.lproj/Localizable.strings
Languages: es, fi, ja, ko, zh_hans

source: Advanced
es: Avanzado
fi: Lisäasetukset
ja: 高度
ko: 고급
zh_hans: 高级

# app.device.jailbreak.title
source: DEVICE SECURITY COMPROMISED
es: SEGURIDAD DEL DISPOSITIVO COMPROMETIDA
fi: TÄMÄN LAITTEEN TIETOTURVA EI OLE KUNNOSSA
ja: デバイスのセキュリティが危険にさらされています
ko: 장치 보안이 침해되었습니다
zh_hans: 设备安全性受损

source: Done
es: Hecho
fi: Valmis
ja: 完了
ko: 완료
zh_hans: 已完成

source: Cancel
es: Cancelar
fi: Peru
ja: キャンセル
ko: 취소
zh_hans: 取消

source: Continue
es: Continuar
fi: Jatka
zh_hans: 继续

source: Skip
es: Omitir
fi: Ohita
zh_hans: 跳过

source: Save
es: Guardar
fi: Tallenna
ja: 保存
ko: 저장
zh_hans: 保存

source: Delete
es: Eliminar
fi: Poista
ja: 削除
ko: 삭제
zh_hans: 删除

source: Reload
es: Volver a cargar
fi: Päivitä
ja: 再読み込み
ko: 다시 불러오기
zh_hans: 重新加载

source: Share
es: Compartir
fi: Jaa
ja: シェア
ko: 공유
zh_hans: 共享

source: Set as Home Page
fi: Aseta kotisivuksi

# browserHistory
source: History
fi: Historia

source: My Bookmarks
fi: Kirjanmerkit

source: New
es: Nuevo
fi: Uusi
ja: 新規
ko: 신규
zh_hans: 新

source: Bookmarks
es: Marcadores
fi: Kirjanmerkit
ja: ブックマーク
ko: 북마크
zh_hans: 书签夹

source: History
es: Historial
fi: Historia
ja: 履歴
ko: 기록
zh_hans: 历史记录

source: Error
fi: Virhe

source: Warning
fi: Varoitus

# configureTransaction.error.gasFeeTooHigh
source: Gas Fee too high. Max: %@
es: Tarifa de gas demasiado alta. Máximo disponible: %@
fi: Kulujen perushinta (Gas Fee) liian korkea. Suurin sallittu: %@
ja: ガス料金が高すぎます。利用可能な最大: %@
ko: 가스 수수료가 너무 높습니다. 최대 이용 한도: %@
zh_hans: 燃料费太高。可用上限：%@

# configureTransaction.error.gasLimitTooHigh
source: Gas Limit too high. Max available: %d
es: Límite de gas demasiado alto. Máximo disponible: %d
fi: Kuluraja (Gas Limit) liian suuri. Suurin sallittu: %d
ja: ガス制限が高すぎます。利用可能な最大: %d
ko: 가스 한도가 너무 높습니다. 최대 이용 한도: %d
zh_hans: 燃料限制太高。 可用上限：%d

# configureTransaction.error.nonceNotPositiveNumber
source: Nonce must be a positive number
es: El nonce debe ser un número positivo
fi: Satunnaistunnuksen (Nonce) on oltava positiivinen kokonaisluku
zh_hans: Nonce 必须是一个正值

# configureTransaction.gasLimit.label.description
source: The gas limit prevents smart contracts from consuming all your %@. We will try to calculate the gas limit automatically for you, but some smart contracts may require a custom gas limit.
es: El límite de gas evita que los contratos inteligentes consuman todo tu %@. Intentaremos calcular el límite de gas de forma automática, pero algunos contratos inteligentes requieren un límite de gas personalizado.
fi: Kuluraja (Gas Limit) estää älysopimuksia käyttämstä kaikkea valuuttaa %@. Raja lasketaan automaattisesti, mutta jotkut älysopimukset saattavat vaatia, että muutat rajaa.
ja: ガスの制限によって、スマート契約はすべての %@を消費できなくします。このアプリは、自動的にガスの制限を計算を試行しまが、スマート契約によってはカスタムのガス制限を必要とすることがあります。
ko: 가스 한도는 스마트 계약이 %@을(를) 전부 소비하지 않도록 합니다. 가스 한도는 자동으로 계산되지만, 일부 스마트 계약은 사용자 정의 가스 한도가 필요할 수 있습니다.
zh_hans: 燃料限制可防止智能合约消耗掉您的所有%@。我们会尝试为您自动计算燃料限制，但部分智能合约可能需要自定义燃料限制。

# configureTransaction.gasLimit.label.title
source: Gas Limit
es: Límite de gas
fi: Kuluraja (Gas Limit)
ja: ガスの制限
ko: 가스 한도
zh_hans: 燃料限制

# configureTransaction.totalNetworkFee.label.title
source: Total network fee
es: Tarifa total de red
fi: Kulut yhteensä
ja: 総合ネットワーク料金
ko: 총 네트워크 수수료
zh_hans: 总计网络费用

# transaction.confirmation.label.title
source: Confirmation
es: Confirmación
fi: Varmistusnumero
ja: 確認
ko: 확인
zh_hans: 确认

# transaction.from.label.title
source: From
es: De
fi: Lähettäjä
ja: 送信元
ko: 발신인
zh_hans: 来源地址

# transaction.gasFee.label.title
source: Gas Fee
es: Tarifa de gas
fi: Kulut (Gas Fee)
ja: ガス料金
ko: 가스 수수료
zh_hans: 燃料费用

# transaction.to.label.title
source: To
es: A
fi: Vastaanottaja
ja: 宛先
ko: 수취인
zh_hans: 接收地址

# transaction.time.label.title
source: Transaction time
es: Hora de la transacción
fi: Tilitapahtuman ajankohta
ja: トランザクション時間
ko: 거래 시간
zh_hans: 交易时间

# transaction.id.label.title
source: Transaction #
es: Transacción n.º
fi: Tilitapahtuman järjestysnumero
ja: トランザクション番号
ko: 거래 번호
zh_hans: 交易 #

# transaction.blockNumber.label.title
source: Block #
es: Bloque n.º
fi: Lohkon järjestysnumero
ja: ブロック番号
ko: 블록 번호
zh_hans: 区块 #

# transaction.nonce.label.title
source: Nonce
fi: Tilitapahtuman satunnaistunnus (nonce)

# confirmPayment.confirm.button.title
source: Confirm
es: Confirmar
fi: Vahvista
ja: 確認
ko: 확인
zh_hans: 确认

# confirmPayment.sign.button.title
source: Sign
fi: Allekirjoita

# confirmPayment.reject.button.title
source: Reject
fi: Peru

# confirmPayment.connect.button.title
source: Connect
fi: Kytkeydy

# confirmPayment.from.label.title
source: From
es: De
fi: Lähettäjä
ja: 送信元
ko: 발신인
zh_hans: 来源地址

# confirmPayment.gasFee.label.title
source: Estimate Network Fee
es: Estimación de la tarifa de red
fi: Kulujen perushinta (Gas Fee)
ja: ネットワーク料金
ko: 네트워크 수수료
zh_hans: 估计网络费用

# confirmPayment.gasLimit.label.title
source: Gas Limit
es: Límite de gas
fi: Kulujen yläraja
ja: ガスの制限
ko: 가스 한도
zh_hans: 燃料限制

# confirmPayment.gasPrice.label.title
source: Gas Price
es: Precio del gas
fi: Kulujen yksikköhinta (Gas Price)
ja: ガス価格
ko: 가스 요금
zh_hans: 燃料价格

# confirmPayment.to.label.title
source: To
es: A
fi: Vastaanottaja
ja: 宛先
ko: 수취인
zh_hans: 接收地址

# confirmPayment.highFeeWarning
source: %@ - WARNING. HIGH FEE.
es: %@ - ADVERTENCIA. TARIFA ALTA.
fi: %@ - VAROITUS. KALLIS TRANSAKTIO.
ja: %@ - 警告。高い料金。
ko: %@ - 경고. 수수료가 높음.
zh_hans: %@ - 警告。费用过高。

source: Copy
es: Copiar
fi: Kopioi
ja: コピー
ko: 복사
zh_hans: 复制

source: Empty
es: Vacío
fi: Tyhjä
ja: 空
ko: 비어 있음
zh_hans: 空

# emptyView.noTokens.label.title
source: You haven't received any tokens yet!
es: ¡Todavía no has recibido ningún token!
fi: Et ole vastaanottanut vielä rahakkeita!
ja: まだトークンを受け取っていません!
ko: 아직 받은 토큰이 없습니다!
zh_hans: 您尚未收到任何通证！

# errorView.description.label.title
source: Something went wrong... Try again.
es: Ha habido un problema... Inténtalo de nuevo.
fi: Jokin meni pieleen... Yritä uudestaan.
ja: エラーが発生しました... もう一度試してください。
ko: 무언가 잘못되었습니다... 다시 시도하십시오.
zh_hans: 出问题了... 再试一次。

# export.backup.button.title
source: Backup Wallet
es: Copia de seguridad del monedero
fi: Varmuuskopioi
ja: ウォレットをバックアップ
ko: 지갑 백업
zh_hans: 备份钱包

# export.controlYourMoney.label.title
source: Since only you control your money, you'll need to save your backup keystore in case this app is deleted.
es: Como solo tú controlas tu dinero, tendrás que guardar la copia de seguridad del almacén de claves por si se elimina esta aplicación.
fi: Lompakon sisältö on vain hallinnassasi. Tallenna avainten varmuuskopiot siltä varalta, että tämä sovellus poistetaan.
ja: あなたのお金を制御するのはあなただけなので、このアプリが削除された場合に備え、バックアップ キーストアを保存する必要があります。
ko: 고객님의 돈은 고객님 본인만 통제할 수 있으므로 이 앱이 삭제될 경우에 대비하여 백업 키스토어를 저장해 놓아야 합니다.
zh_hans: 您的资金由您掌控！请务必保存好备份密钥库，以防此应用遭到删除。

# export.neverStored.label.title
source: Your wallet is never saved to cloud storage or standard device backups.
es: Tu monedero no se guarda nunca en el almacenamiento en la nube o en copias de seguridad estándar del dispositivo.
fi: Lompakkosi sisältä ei koskaan talleta pilvipalveluun tai muihin iPhone varmuuskopioihin.
ja: ウォレットは、クラウド ストレージまたは標準デバイスのバックアップには決して保存されません。
ko: 고객님의 지갑은 절대로 클라우드 스토리지 또는 표준 장치 백업에 저장되지 않습니다.
zh_hans: 我们绝不会将您的钱包保存到云存储或标准备份设备中。

# export.noBackup.label.title
source: Be safe, back up your wallet
es: Siempre a salvo, haz una copia de seguridad de tu monedero
fi: Varmuuskopioi
zh_hans: 安全起见，请备份您的钱包

# export.presentBackupOptions.label.title
source: Preparing backup options...
es: Preparando opciones de copia de seguridad...
fi: Valmistelee varmuuskopiovalintoja...
ja: バックアップ オプションを準備しています...
ko: 백업 옵션 준비 중...
zh_hans: 正在准备备份选项...

# importWallet.importingIndicator.label.title
source: Importing wallet...
es: Importando monedero...
fi: Lompakon tuonti (import)
ja: ウォレットをインポートしています...
ko: 지갑을 가져오는 중...
zh_hans: 正在导入钱包...

source: Loading
es: Cargando
fi: Lataa
ja: 読み込み
ko: 불러오는 중
zh_hans: 正在加载

# LoadingDots
source: Loading...
es: Cargando...
fi: Lataa...
ja: 読み込み中...
ko: 불러오는 중...
zh_hans: 正在加载...

source: Next
es: Siguiente
fi: Seuraava
ja: 次へ
ko: 다음
zh_hans: 下一步

source: Password
es: Contraseña
fi: Salasana
ja: パスワード
ko: 비밀번호
zh_hans: 密码

source: Refresh
es: Actualizar
fi: Päivitä
ja: リフレッシュ
ko: 새로 고침
zh_hans: 刷新

# request.copyWallet.button.title
source: Copy wallet address
es: Copiar la dirección del monedero
fi: Kopioi lompakon osoite
ja: ウォレットのアドレスをコピー
ko: 지갑 주소 복사
zh_hans: 复制钱包地址

source: Retry
es: Reintentar
fi: Yritä uudelleen
ja: 再試行
ko: 다시 시도
zh_hans: 重试

source: Send
es: Enviar
fi: Lähetä
ja: 送信
ko: 보내기
zh_hans: 发送

source: Receive
es: Recibir
fi: Vastaanota
zh_hans: 接收

# send.error.emptyClipBoard
source: Empty ClipBoard
es: Vaciar portapapeles
fi: Tyhjä leikepöytä
ja: クリップボードが空です
ko: 빈 클립보드
zh_hans: 剪贴板为空

# send.error.invalidAddress
source: Invalid Address
es: Dirección no válida
fi: Virheellinen osoite
ja: 無効なアドレス
ko: 잘못된 주소
zh_hans: 无效地址

# send.error.invalidAmount
source: Invalid Amount
es: Cantidad no válida
fi: Virheellinen summa
ja: 無効な金額
ko: 잘못된 금액
zh_hans: 无效金额

# send.error.wrongInput
source: Wrong Input
es: Entrada incorrecta
fi: Virheellinen syöte
ja: 誤った入力
ko: 잘못된 입력
zh_hans: 输入错误

# send.paste.button.title
source: Paste
es: Pegar
fi: Sijoita
ja: ペースト
ko: 붙여넣기
zh_hans: 粘贴

# send.paste.button.addressBook
source: Address Book
es: Libreta de direcciones
fi: Osoitekirja
zh_hans: 地址簿

# send.amount
source: Amount
es: Cantidad
fi: Summa
zh_hans: 价值

# send.recipient
source: Recipient
es: Destinatario
fi: Vastaanottaja
zh_hans: 接收人

# send.recipientsAddress
source: Recipient’s Address
es: Dirección del destinatario
fi: Vastaanottajan osoite
zh_hans: 接收人地址

# send.invalid.Token
source: Invalid token
es: Token no válido
fi: Virheellinen rahake
zh_hans: 无效通证

# send.available
source: Available: %@
es: Disponible: %@
fi: Käytettävissä: %@
zh_hans: 可用： %@

# settings.biometricsDisabled.label.title
source: Passcode
es: Código de acceso
fi: PIN-koodi
ja: パスコード
ko: 암호
zh_hans: 密码

# settings.biometricsEnabled.label.title
source: Passcode / %@
es: Código de acceso / %@
fi: PIN-koodi / %@
ja: パスコード/ %@
ko: 암호 / %@
zh_hans: 密码 / %@

# settings.error.failedToSendEmail
source: Failed to send email. Make sure you have Mail app installed.
es: Error al enviar el correo electrónico. Asegúrate de que tienes una aplicación de correo instalada.
fi: Sähköpostin lähetys epäonnistui.
ja: メールを送信できませんでした。メール アプリのインストールを確認してください。
ko: 이메일을 전송하지 못했습니다. 메일 앱이 설치되어 있는지 확인하십시오.
zh_hans: 发送电子邮件失败。请确保您已安装邮件应用。

# settings.network.button.title
source: Network
es: Red
fi: Verkko
ja: ネットワーク
ko: 네트워크
zh_hans: 网络

# settings.enabledNetworks.mainnet
source: Mainnet
fi: Tuotantoverkko (Mainnet)

# settings.enabledNetworks.testnet
source: Testnet
fi: Testiverkko (Testnet)

# settings.enabledNetworks.promptEnableTestnet.title
source: What is Testnet?
fi: Mikä on testiverkko?

# settings.enabledNetworks.promptEnableTestnet.description
source: Testnets tokens are like ‘Monopoly’ money. They have zero financial worth but are used by developers to try out new designs without needing to spend valuable coins.
fi: Testiverkon rahakkeet ovat leluja. Niillä ei ole järjestelmän ulkopuolista arvoa. Et voi vaihtaa niitä rahaksi. Kehittäjät käyttävät niitä testatakseen toimintoja.

# settings.enabledNetworks.promptEnableTestnet.button.title
source: Got it, enable Testnets
fi: Ymmärsin, käytä testiverkkoa

# settings.enabledNetworks.delete.title
source: Are you sure you would like to delete this server?
fi: Oletko varma, että haluat poistää tämän lohkoketjun?

# settings.enabledNetworks.delete.message
source: This will restart the app
fi: Sovellus käynnistetään uudestaan

# settings.language.button.title
source: Change Language
es: Cambiar idioma
fi: Vaihda kieltä
zh_hans: 更换语言

# settings.backupWallet.button.title
source: Back up this Wallet
es: Hacer una copia de seguridad de este monedero
fi: Varmuuskopioi lompakko
zh_hans: 备份此钱包

# settings.showSeedPhrase.button.title
source: Show Seed Phrase
fi: Näytä siemenlause (Seed Phrase)

# settings.walletConnect.button.title
source: WalletConnect
fi: Kytke lompakko (WalletConnect)

# settings.chooseSendPrivateTransactionsProvider.button.title
source: Private ETH transactions
fi: Paikalliset ETH tilitapahtumat

# settings.language.useSystem.title
source: Use System Setting
es: Usar la configuración del sistema
fi: Järjestelmän oletuskieli
ja: システム設定を使用
ko: 시스템 설정 사용
zh_hans: 使用系统设置

# settings.version.label.title
source: Version
es: Versión
fi: Versio
ja: バージョン
ko: 버전
zh_hans: 版本

# settings.tokenScriptStandard.title
source: TokenScript Compatibility
es: Compatibilidad de TokenScript
fi: TokenScript-yhteensopivuus
ko: TokenScript Standard
zh_hans: TokenScript 兼容性

# settings.advanced.exportJSONKeystore.title
source: Export Keystore JSON
fi: Vie JSON-avaintallenne

# settings.advanced.exportJSONKeystore.file.title
source: Export Keystore JSON
fi: Vie JSON-avaintallenne

# settings.advanced.exportJSONKeystore.file.label
source: Your Keystore JSON
fi: JSON-avaintallenne

# settings.advanced.exportJSONKeystore.file.passwordButton.info
source: Set Password for Keystore JSON
fi: Aseta salasana JSON-avaintallenteelle

# settings.advanced.exportJSONKeystore.file.passwordButton.password
source: Export Keystore JSON
fi: Vie JSON-avaintallenne

# settings.advanced.exportJSONKeystore.password.title
source: Set Password for Keystore JSON
fi: Aseta salasana JSON-avaintallenteelle

# settings.advanced.exportJSONKeystore.password.label
source: Password
fi: Salasana

# settings.advanced.exportJSONKeystore.password.passwordButton.info
source: Export Keystore JSON
fi: Vie JSON-avaintallenne

# settings.advanced.exportJSONKeystore.password.passwordButton.password
source: Your Keystore JSON
fi: JSON-avaintallenne

# settings.advanced.exportJSONKeystore.file.exporting
source: Exporting
fi: Vie

# settings.general.title
source: General
es: Generales
fi: Yleiset
ja: 一般的な
ko: 일반
zh_hans: 通用

# settings.advanced.title
source: Advanced
es: Avanzado
fi: Lisäasetukset
zh_hans: 高级

# settings.contactUs.title
source: Contact Us
es: Contacta con nosotros
fi: Ota yhteyttä
zh_hans: 联系我们

# settings.changeCurrency.title
source: Change Currency
es: Cambiar moneda
fi: Vaihda valuutta
zh_hans: 更改货币

# settings.analitycs.title
source: Analytics
es: Análisis
fi: Analytiikka
zh_hans: 分析

# settings.pingInfura.title
source: Ping Infura
fi: Testaa Infura

# settings.pingInfura.successful
source: Infura looks OK
fi: Infura toimii

# settings.pingInfura.fail
source: Infura Error
fi: Infura-virhe

# settings.support.title
source: Support
es: Asistencia
fi: Tuki
zh_hans: 支持

# settings.notifications.title
source: Notifications
es: Notificaciones
fi: Ilmoitukset
zh_hans: 通知设置

# settings.passcode.title
source: Passcode / Touch ID
es: Código / Touch ID
fi: PIN-koodi
zh_hans: 密码 / Touch ID

# settings.selectActiveNetworks.title
source: Select Active Networks
es: Seleccionar redes activas
fi: Kytketyt verkot

# settings.section.help.title
source: Help
es: Ayuda
fi: Apu
zh_hans: 帮助

# settings.section.system.title
source: System
es: Sistema
fi: Järjestelmä
zh_hans: 系统

# settings.section.wallet.title
source: Wallet
es: Monedero
fi: Lompakko
zh_hans: 我的钱包

# settings.change.wallet.title
source: Change / Add Wallet
es: Cambiar / Añadir monedero
fi: Vaihda / lisää lomapakko
zh_hans: 更改/添加钱包

# settings.show.my.wallet.title
source: Show My Wallet Address
es: Mostrar la dirección de mi monedero
fi: Näytä lompakon osoite
zh_hans: 显示我的钱包地址

# suppport.title
source: Support
es: Asistencia
fi: Tuki
zh_hans: 支持

# transactions.noTransactions.label.title
source: No Transactions Yet!
es: ¡Todavía no hay transacciones!
fi: Ei vielä tapahtumia!
ja: トランザクションはまだありません!
ko: 아직 거래가 없습니다!
zh_hans: 尚无交易！

# wallet.navigation.title
source: Change Wallet
es: Cambiar monedero
fi: Vaihda lompakkoa
zh_hans: 更换当前钱包

# wallets.navigation.title
source: Wallets
fi: Lompakot

# wallet.types.summary
source: Summary
fi: Yhteenveto

# wallet.types.hdWallets
source: Connected Wallets
es: Tus monederos
fi: Kytketyt lompakot
ja: HD Wallets
ko: HD Wallets
zh_hans: 您的钱包

# wallet.types.keystoreWallets
source: Keystore Wallets
es: Monederos del almacén de claves
fi: Avainlompakot
zh_hans: 密钥库钱包

# wallet.types.watchedWallets
source: Watch-only Wallets
es: Monederos de solo observación
fi: Seuratut lompakot
ja: Watched Wallets
ko: Watched Wallets
zh_hans: 只能查看的钱包

# wallet.create.button.title
source: Create Wallet
es: Crear monedero
fi: Luo lompakko
ja: ウォレットを作成
ko: 지갑 생성
zh_hans: 创建钱包

# wallet.watch.button.title
source: Watch Wallet
es: Observar monedero
fi: Seuraa lompakkoa
zh_hans: 查看钱包

# wallet.create.inProgress
source: Creating wallet...
es: Creando monedero...
fi: Lompakkoa luodaan...
ja: ウォレットを作成しています...
ko: 지갑 생성 중...
zh_hans: 正在创建钱包...

# wallet.import.button.title
source: Import Wallet
es: Importar monedero
fi: Tuo lompakko
ja: ウォレットをインポート
ko: 지갑 가져오기
zh_hans: 导入钱包

# wallets.backupKeystoreWallet.alertSheet.title
source: Export Keystore JSON
es: Exportar el JSON del almacén de claves
fi: Vie JSON-avaintallenne
zh_hans: 导出密钥库 JSON

# wallets.backupKeystoreWallet.alertSheet.title.shorter
source: Export Keystore
es: Exportar almacén de claves
fi: Vie avaintallenne
zh_hans: 导出密钥库

# wallets.backupKeystoreWallet.introduction.title
source: What is Keystore JSON?
es: ¿Qué es el JSON del almacén de claves?
fi: Mikä on JSON-avaintallenne?
zh_hans: 什么是密钥库 JSON？

# wallets.backupKeystoreWallet.introduction.description
source: A Keystore is a text file. You can copy its contents when you want to import your wallet. This is a safe way to back up a wallet.
es: Un almacén de claves es un archivo de texto. Puedes copiar su contenido cuando desees importar tu monedero. Se trata de una forma segura de hacer una copia de seguridad de un monedero.
fi: Avaintallenne on tekstitiedosto, jonka sisällön voit kopioida talteen. Avaintallenteen avulla voit luoda turvallisen varmuuskopion lompakostasi.
zh_hans: 密钥库是一个文本文件。当您要导入钱包时，可以复制其内容。这是备份钱包的安全方法。

# wallets.backupHdWallet.alertSheet.title
source: Show Seed Phrase
es: Mostrar frase semilla
fi: Näytä siemenlause (Seed Phrase)
zh_hans: 显示助记词

# wallets.backupHdWallet.introduction.button.title
source: Back up my Wallet
es: Hacer una copia de seguridad de mi monedero
fi: Varmuuskopio lompakko
zh_hans: 备份我的钱包

# wallets.backupHdWallet.introduction.title
source: Back up your Wallet with Seed Phrase
es: Haz una copia de seguridad de tu monedero con la frase semilla
fi: Varmuuskopio lompakkosi kopiomalla siemenlause (Seed Phrase) paperille
zh_hans: 通过助记词备份您的钱包

# wallets.showSeedPhrase.introduction.button.title
source: Got it, show my seed phrase
fi: Ymmärsin. Näytä siemenlause

# wallets.showSeedPhrase.introduction.title
source: Beware of scammers! Don’t share seed phrase.
fi: Varo huijareita! Älä jaa siemenlausetta kenellekään.

# wallets.showSeedPhrase.introduction.subtitle
source: AlphaWallet will NEVER ask about your seed phrase (especially on Telegram).
fi: Tukipalvelumme ei koskaan pyydä siemenlausetta (varsinkaan Telegram:issa).

# wallets.showSeedPhrase.subtitle2
source: Your seed phrase (do not share with anyone)
fi: Siemenlause (älä jaa tätä kenellekään)

# wallets.showSeedPhrase.hideSeedPhrase
source: OK, hide my seed phrase
fi: OK, piilota siemenlause

# wallets.showSeedPhrase.title
source: Your Seed Phrase
es: Tu frase semilla
fi: Siemenlause
zh_hans: 您的助记词

# wallets.showSeedPhrase.subtitle
source: Making backup is very simple and safe: just write down these 12/24 words and keep them in a secret place, offline.
es: Escribe la frase semilla en un papel: solo tienes que escribir 12 palabras y guardarlas en un lugar seguro, fuera de línea.
fi: Varmuuskopiointi on helppoa: talleta nämä 12 tai 24 sanaa annetussa järjestyksessä turvallisesti, esim. paperilla.
ja: Write down seed phrase on paper: just write down 12 words and keep them in a safe place, offline.
ko: Write down seed phrase on paper
zh_hans: 在纸上写下助记词： 只需写下 12 个单词，并将其保存在一个安全的线下之地。

# wallets.showSeedPhrase.testSeedPhrase
source: OK, I wrote this down
es: Vale, he escrito esto
fi: OK, kirjoitin tämän talteen
zh_hans: 好的，我记下来了

# wallets.showSeedPhrase.doNotTakeScreenshotDescription
source: It's not a good idea to take a screenshot of your seed phrase
es: No es una buena idea hacer una captura de pantalla de la frase semilla
fi: Siemenlauseen tallettaminen ruudunkaappauksena ei ole suositeltu toimintatapa
zh_hans: 切勿将助记词保存为屏幕截图

# wallets.verifySeedPhrase.title
source: Verify Seed Phrase
es: Verificar la frase semilla
fi: Tarkista siemenlause (Seed Phrase)
zh_hans: 验证助记词

# wallets.verifySeedPhrase.wrong
source: Invalid seed phrase. Please check and try again.
es: Frase semilla no válida. Revísala e inténtalo de nuevo.
fi: Virheellinen siemenlause. Yritä uudestaan.
zh_hans: 无效助记词。请检查并重试。

# wallets.verifySeedPhrase.doNotTakeScreenshotDescription
source: It's not a good idea to take a screenshot of your seed phrase
es: No es una buena idea hacer una captura de pantalla de la frase semilla
fi: Siemenlauseen tallettaminen ruudunkaappauksena ei ole suositeltu toimintatapa
zh_hans: 切勿将助记词保存为屏幕截图

# wallets.name.rename
source: Rename Wallet
fi: Nimeä lompakko

# wallets.name.rename.to
source: Rename Wallet to
fi: Lompakon uusi nimi:

# wallets.addHideTokens.title
source: Add / Hide Tokens
es: Añadir / Ocultar tokens
fi: Lisää / piilota rahakkeita
zh_hans: 添加/隐藏通证

# wallets.hideToken.title
source: Hide
es: Ocultar
fi: Piilota
zh_hans: 隐藏

# addHideTokens.title
source: Add / Hide Tokens
es: Añadir / Ocultar tokens
fi: Lisää / piilota rahakkeita
zh_hans: 添加/隐藏通证

# addHideTokens.section.newTokens
source: New Token Found
es: Nuevo token encontrado
fi: Uusi havaittu rahake
zh_hans: 找到新通证

# addHideTokens.section.displayedTokens
source: Displayed Tokens
es: Tokens mostrados
fi: Näytetyt rahakkeet
zh_hans: 显示的通证

# addHideTokens.section.hiddenTokens
source: Hidden Tokens
es: Tokens ocultos
fi: Piilotetut rahakkeet
zh_hans: 隐藏的通证

# addHideTokens.section.popularTokens
source: Popular Tokens
fi: Suositut rahakkeet

# transactions.tabbar.item.title
source: Transactions
es: Transacciones
fi: Tapahtumat
ja: 私のトランザクション
ko: 내 거래
zh_hans: 我的账单

# transactions.received.ether
source: You have received %@ %@
es: Has recibido %@ %@
fi: Olet vastaanottanut %@ %@
zh_hans: 您已收到%@ %@

# transactions.received.ether.notification.prompt
source: Allow Notifications When You Receive %@?
es: ¿Permitir notificaciones al recibir %@?
fi: Salli ilmoitukset kun vastaanotat valuuttaa %@?
zh_hans: 是否在收到%@时允许通知？

# transaction.navigation.title
source: Transaction
es: Transacción
fi: Tapahtuma
ja: トランザクション
ko: 거래
zh_hans: 交易

# activity.tabbar.item.title
source: Activity
fi: Tapahtumat

# import.navigation.title
source: Import Wallet
es: Importar monedero
fi: Tuo lompakko
ja: ウォレットをインポート
ko: 지갑 가져오기
zh_hans: 导入钱包

# configureTransaction.data.label.title
source: Transaction Data (Optional)
es: Datos de la transacción (opcional)
fi: Tilitapahtuman tiedot (valinnainen)
ja: トランザクション データ (オプション)
ko: 거래 데이터 (선택 사항)
zh_hans: 交易数据（可选）

# configureTransaction.nonce.label.title
source: Nonce (Optional)
es: Nonce (opcional)
fi: Satunnaistunnus (Nonce; valinnainen)
zh_hans: Nonce（可选）

# confirmPayment.data.label.title
source: Data
es: Datos
fi: Tiedot
ja: データ
ko: 데이터
zh_hans: 数据

# confirmPayment.nonce.label.title
source: Nonce
fi: Satunnaistunnus (Nonce)

source: Contract Address
es: Dirección del contrato
fi: Älysopimuksen osoite
ja: 契約アドレス
ko: 계약 주소
zh_hans: 智能合约地址

source: Copy Address
es: Copiar dirección
fi: Kopio osoite
ja: アドレスをコピー
ko: 주소 복사
zh_hans: 复制地址

source: Decimals
es: Decimales
fi: Desimaalien lukumäärä
ja: 小数点
ko: 소수점
zh_hans: 小数点

# warning.fieldRequired
source: Field required!
es: ¡Campo obligatorio!
fi: Pakollinen tieto!
ja: 必須フィールド!
ko: 필수 필드!
zh_hans: 必填字段！

# detecting.token.type.title
source: Detecting token type…
es: Detectando tipo de token…
fi: Rahakkeen tyyppiä tunnistetaan…
ja: トークンのタイプを検出中...
ko: 토큰 유형 검색 중...
zh_hans: 正在检测通证类型…
