Repository: AlphaWallet/alpha-wallet-ios
Catalog: AlphaWallet/Localization/*.lproj/Localizable.strings
Languages: es, fi, ja, ko, zh_hans

# detecting.serverAutomatically
source: Detect Automatically
es: Detectar automáticamente
fi: Täytä automaattisesti
zh_hans: 自动检测

# editTokens.searchBar.placeholder.title
source: Search tokens
es: Buscar tokens
fi: Etsi rahakkeita
ja: 検索のトークン
ko: 토큰 검색
zh_hans: 搜索通证

# importWallet.import.alertSheet.title
source: Import Wallet Options
es: Opciones de importación de monedero
fi: Lompakon tuonnin valinnat
ja: ウォレットのインポート オプション
ko: 지갑 옵션 가져오기
zh_hans: 导入钱包选项

# importWallet.import.button.title
source: Import
es: Importar
fi: Tuo
ja: インポート
ko: 가져오기
zh_hans: 导入

# importWallet.import.invalidAddress
source: Invalid Ethereum Address
es: Dirección de Ethereum no válida
fi: Virheellinen Ethereum-osoite
ja: 無効な Ethereum アドレス
ko: 잘못된 이더리움 주소
zh_hans: 无效以太坊地址

# importWallet.import.invalidPrivateKey
source: Private Key has to be 64 characters long
es: La clave privada debe tener 64 caracteres de longitud
fi: Salaisen avaimen tulee olla 64 merkkiä pitkä
ja: 秘密鍵は64文字でなければなりません
ko: 개인 키의 길이는 64자이어야 합니다.
zh_hans: 私钥至少需要 64 个字符

# importWallet.import.invalidMnemonicCount.12
source: Seed phrase has to be 12
fi: Siemenlauseen (Seed Phrase) tulee olla 12 englanninkielistä sanaa

# importWallet.import.invalidMnemonicCount.24
source: Seed phrase has to be 12 or 24 words
fi: Siemenlauseen (Seed Phrase) tulee olla 12 tai 24 englanninkielistä sanaa

# importWallet.import.invalidMnemonic
source: Seed phrase is invalid
es: La frase semilla no es válida
fi: Siemenlause (Seed Phrase) on virheellinen
zh_hans: 助记词无效

# importWallet.import.fromCloud.title
source: Import from iCloud/Dropbox/Google Drive
es: Importar desde iCloud/Dropbox/Google Drive
fi: Tuo kohteesta iCloud/Dropbox/Google Drive
zh_hans: 从 iCloud/Dropbox/Google Drive 导入

# importWallet.import.seedPhrase.description
source: If your seed phrase is not in English, please convert it to English first
es: Si tu frase semilla no está en inglés, pásala primero a inglés
fi: Jos siemenlause ei ole englanniksi, käännä se ensin englanniksi
zh_hans: 如果您的助记词不是英语，请先将其转换为英语

source: Keystore JSON
es: JSON del almacén de claves
fi: JSON-avaintallenne
zh_hans: 密钥库 JSON

source: More Details
es: Más detalles
fi: Enemmän yksityiskohtia
ja: 詳細
ko: 자세한 정보
zh_hans: 更多详情

source: View in %@
es: Ver en %@
fi: Tarkastele sovelluksella %@
zh_hans: 在%@中查看

# Keystore
source: Keystore JSON
es: JSON del almacén de claves
fi: JSON-avaintallenne
zh_hans: 密钥库 JSON

# Keystore.shorter
source: Keystore
es: Almacén de claves
fi: Avaintallenne
zh_hans: 密钥库

source: Private Key
es: Clave privada
fi: Salainen avain
ja: 秘密鍵
ko: 개인 키
zh_hans: 私钥

# settings.currency.button.title
source: Currency
es: Moneda
fi: Valuutta
ja: 通貨
ko: 통화
zh_hans: 货币

# settings.network.test.label.title
source: Test
es: Prueba
fi: Testi
ja: テスト
ko: 테스트
zh_hans: 测试

# settings.wallets.button.title
source: Change Wallet
es: Cambiar monedero
fi: Vaihda lompakko
zh_hans: 更换当前钱包

source: Symbol
es: Símbolo
fi: Symboli
ja: シンボル
ko: 기호
zh_hans: 符号

source: Today
es: Hoy
fi: Tänään
ja: 今日
ko: 오늘
zh_hans: 今天

# token.lowercase
source: token
fi: rahake
ja: トークン
ko: 토큰
zh_hans: 通证

# token.titlecase
source: Token
fi: Rahake
ja: トークン
ko: 토큰
zh_hans: 通证

# tokens.lowercase
source: tokens
fi: rahakkeet
ja: トークン
ko: 토큰
zh_hans: 通证

# tokens.titlecase
source: Tokens
fi: Rahakkeet
ja: トークン
ko: 토큰
zh_hans: 通证

# ticket.lowercase
source: ticket
fi: toimeksianto
ja: チケット
ko: 티켓
zh_hans: 门票

# ticket.titlecase
source: Ticket
fi: Toimeksianto
ja: チケット
ko: 티켓
zh_hans: 门票

# tickets.lowercase
source: tickets
fi: toimeksiannot
ja: チケット
ko: 티켓
zh_hans: 门票

# tickets.titlecase
source: Tickets
fi: Toimeksiannot
ja: チケット
ko: 티켓
zh_hans: 门票

# tokens.newtoken.navigation.title
source: Add Custom Token
es: Añadir token personalizado
fi: Lisää rahake
ja: カスタム トークンを追加
ko: 사용자 정의 토큰 추가
zh_hans: 添加订制代币

# transaction.cell.error.title
source: Error
fi: Virhe
ja: エラー
ko: 오류
zh_hans: 错误

# transaction.cell.received.title
source: Received
es: Recibido
fi: Vastaanotettu
ja: 受信しました
ko: 받음
zh_hans: 收到了

# transaction.cell.sent.title
source: Sent
es: Enviado
fi: Lähetetty
ja: 送信しました
ko: 보냄
zh_hans: 发送了

# transaction.cell.tokenTransfer.title
source: Transfer %@
es: Transferir %@
fi: Lähetä valuuttaa: %@
ja: %@ を送信
ko: %@ 전송
zh_hans: 转出%@

# transaction.cell.tokenApprove.title
source: Approve %@
fi: Hyväksy %@

source: Yesterday
es: Ayer
fi: Eilen
ja: 昨日
ko: 어제
zh_hans: 昨天

source: Deleting
es: Eliminando
fi: Poistaa
ja: 削除
ko: 삭제 중
zh_hans: 正在删除

source: Ethereum Address
es: Dirección de Ethereum
fi: Ethereum-osoite
ja: Ethereum アドレス
ko: 이더리움 주소
zh_hans: 以太坊地址

# InCoordinatorError.onlyWatchAccount
source: This wallet could be only used for watching. Import Private Key/Keystore to sign transactions
es: Este monedero solo se podría utilizar para observar. Importa la clave privada/almacén de claves para firmar transacciones
fi: Tätä lompakko voi vain seurata. Tuo salainen avain tai avaintallenne, jos haluat allekirjoittaa uusia tapahtumia.
ja: このウォレットは、見るためだけに使用できます。秘密鍵/キーストアをインポートしてトランザクションを署名します
ko: 이 지갑은 열람용으로만 사용할 수 있습니다. 거래에 서명하려면 개인 키/키스토어를 가져오십시오
zh_hans: 该钱包只能用于查看。请导入私钥/密钥库以便签署交易

# mnemonic.shorter
source: Seed
es: Semilla
fi: Siemen
zh_hans: 种子

# mnemonic
source: Seed Phrase
es: Frase semilla
fi: Siemenlause (Seed Phrase)
zh_hans: 助记词

source: Watch
es: Observar
fi: Seuraa
ja: 見る
ko: 열람
zh_hans: 查看

# passphrase.remember.label.title
source: Write this down, and keep it private and secure. You won't be able to restore your wallet if you lose this!
es: Escríbela y guárdala en un lugar privado y seguro. ¡No podrás restaurar tu monedero si la pierdes!
fi: Talleta tämä paperilla turvalliseen paikkaan. Et pysty palauttamaan lompakkoasi, jos hukkaat tämän!
ja: これを書き留めて、秘密にして安全に保管してください。これを紛失した場合、ウォレットを復元することはできません!
ko: 이 정보를 적어두고, 안전하게 보관하십시오. 그렇지 않으면, 지갑을 잃어버릴 경우 복구할 수 없게 됩니다!
zh_hans: 把它写下来，并确保其私密性和安全性。如果您弄丢了这个，将再也无法恢复钱包！

# recoveryPhrase.navigation.title
source: Recovery Phrase
es: Frase de recuperación
fi: Palautuslause
ja: 回復フレーズ
ko: 복구 단계
zh_hans: 恢复助记词

# transaction.cell.unknown.title
source: Unknown
es: Desconocido
fi: Tuntematon
ja: 不明
ko: 알 수 없음
zh_hans: 未知

# welldone.description.label.text
source: Help us grow by sharing this app with your friends!
es: ¡Ayúdanos a crecer compartiendo esta aplicación con tus amigos!
fi: Auta meitä jakamalla tämä sovellus ystävillesi!
ja: 友達とこのアプリをシェアして、アプリの成長をご支援ください!
ko: 저희가 더욱 발전할 수 있도록 이 앱을 친구들과 공유해주십시오!
zh_hans: 与好友分享此应用，让我们发展壮大！

# welldone.navigation.title
source: Thank you!
es: ¡Gracias!
fi: Kiitos!
ja: ありがとうございます!
ko: 감사합니다!
zh_hans: 谢谢！

# welldone.share.label.text
source: Share
es: Compartir
fi: Jaa
ja: シェア
ko: 공유
zh_hans: 共享

# welldone.viewmodel.sharing.text
source: Check out AlphaWallet - The first crypto mobile wallet which can interact with smart contracts to perform real-world use cases.
es: Echa un vistazo a AlphaWallet - El primer monedero criptográfico móvil que puede interactuar con contratos inteligentes para llevar a cabo casos de uso en el mundo real.
fi: Tunnetko jo AlfaLompakon, englanniksi AlphaWallet, ensimmäisen kännykässä toimivan kryptolompakon, jossa on sisäänrakennettu tuki älysopimuksille.
ja: AlphaWallet をチェックしてください- 現実の世界のユースケースを実行するスマート契約とのインタラクションを行える、最初の暗号モバイル ウォレット。
ko: AlphaWallet을 확인해보세요. 스마트 계약과 상호 작용하여 실세계에서 이용할 수 있는 최초의 암호화폐 모바일 지갑입니다.
zh_hans: 了解一下 AlphaWallet：可以与智能合约交互，以满足现实用途的首款加密移动钱包。

# browser.home.button.title
source: Home
es: Inicio
fi: Koti
ja: ホーム
ko: 홈
zh_hans: 首页

# browser.reload.button.title
source: Reload
es: Volver a cargar
fi: Lataa sivu uudelleen
ja: 再読み込み
ko: 다시 불러오기
zh_hans: 重新加载

# browser.addbookmark.button.title
source: Add to My Bookmarks
es: Añadir a Mis marcadores
fi: Lisää kirjanmerkkeihinn
zh_hans: 添加至我的书签

# browser.scanQRCode.button.title
source: Scan QR Code for URL
es: Escanear código QR para obtener la URL
fi: Lue QR-koodista URL-osoite
zh_hans: 扫描二维码以获取 URL

# browser.scanQRCode.title
source: Scan QR Code
es: Escanear código QR
fi: Lue QR-koodi
zh_hans: 扫描二维码

# browser.tabbar.item.title
source: Browser
es: Navegador
fi: Selain
ja: ブラウザ
ko: 브라우저
zh_hans: 浏览器

# browser.history.confirm.delete.title
source: Remove History?
es: ¿Eliminar historial?
fi: Poista selaushistoria?
zh_hans: 是否清除历史记录？

# browser.noHistory.label.title
source: Your browser history appears here.
es: Tu historial de navegación aparece aquí.
fi: Selaushistoriasi näkyy täällä.
zh_hans: 此处将显示您的浏览器历史记录。

# browser.bookmarks.confirm.delete.title
source: Are you sure you would like to delete this bookmark?
es: ¿Seguro que deseas eliminar este marcador?
fi: Haluatko varmasti poistaa tämän kirjanmerkin?
zh_hans: 是否确定要删除此书签？

# browser.noBookmarks.label.title
source: No bookmarks yet!
es: ¡Todavía no hay ningún marcador!
fi: Ei kirjanmerkkejä!
zh_hans: 尚无书签！

# browser.url.textfield.placeholder
source: Search or type URL
es: Busca o introduce la URL del sitio web
fi: Hakuteksti tai URL
ja: Search or enter website URL
ko: Search or enter website URL
zh_hans: 搜索或输入网站 URL

# browser.settings.network.description.title
source: More networks will be available when they are enabled in the Settings tab
es: Habrá más redes disponibles cuando se activen en la pestaña de Ajustes
fi: Lisää verkkoja voi kytkeä päälle Asetuksista
zh_hans: 在“设置”标签中启用后，您将可看到更多网络

# configureTransaction.gasPriceGwei.label.title
source: Gas Price (Gwei)
es: Precio del gas (Gwei)
fi: Kulut (Gwei)
ja: ガス価格 (Gwei)
ko: 가스 요금 (Gwei)
zh_hans: 燃料价格（Gwei）

# enterPassword.navigation.title
source: Set Keystore Password
es: Establecer la contraseña del almacén de claves
fi: Aseta avaintallenteen salanana
zh_hans: 设置密钥库密码

# enterPassword.navigation.title.shorter
source: Keystore Password
es: Contraseña del almacén de claves
fi: Avaintallenteen salasana
zh_hans: 密钥库密码

# enterPassword.password.header.placeholder
source: You must remember your password. We do not store your password elsewhere. KeyStore JSON file is always encrypted, otherwise whoever has it has access to your money.
es: Debes recordar tu contraseña. No la almacenamos en ningún sitio. El archivo JSON del almacén de claves siempre está cifrado, de lo contrario, quien la tenga puede acceder a tu dinero.
fi: Älä kadota tätä salasanaa. Älä talleta sitä digitaalisesti vaan paperilla. JSON-avaintallenne on aina salattu rahakkeidesi turvallisuuden takia.
zh_hans: 您必须记住密码。我们不会将您的密码存储在其他地方。密钥库 JSON 文件会始终加密，否则无论是谁，一旦拥有它即可得到您的资金。

# enterPassword.password.textField.placeholder
source: Password to encrypt Keystore JSON
es: Contraseña para cifrar el JSON del almacén de claves
fi: Salasana JSON-avaintallenteen salaamiseen
zh_hans: 用于加密密钥库 JSON 的密码

# enterPassword.password.textField.placeholder.shorter
source: Password to encrypt Keystore
es: Contraseña para cifrar el almacén de claves
fi: Salasana avaintallenteen salaamiseen
zh_hans: 用于加密密钥库的密码

# lock.create.passcode.view.model.confirm
source: Please re-enter your passcode
es: Vuelve a introducir tu código de acceso
fi: Syötä PIN-koodi uudelleen
ja: パスコードを再入力してください
ko: 암호를 다시 입력하십시오
zh_hans: 请重新输入您的密码

# lock.create.passcode.view.model.initial
source: Enter a new passcode
es: Introduce una contraseña nueva
fi: Syötä PIN-koodi
ja: 新しいパスワードを入力してください
ko: 새 비밀번호를 입력하십시오
zh_hans: 输入新密码

# lock.create.passcode.view.model.title
source: Set Passcode
es: Establecer código de acceso
fi: Aseta PIN-koodi
ja: パスコードの設定
ko: 암호 설정
zh_hans: 设置密码

# lock.enter.passcode.view.model.incorrect.passcode
source: Incorrect passcode. You have %d attempts.
es: Código de acceso incorrecto. Te quedan %d intentos.
fi: Väärä PIN-koodi. %d yritystä jäljellä.
ja: パスコードが正しくありません。 %d 回試すことができます。
ko: 암호가 잘못되었습니다. 남은 기회는 %d번입니다.
zh_hans: 密码错误。您可以尝试 %d 次。

# lock.enter.passcode.view.model.initial
source: Enter your passcode.
es: Introduce tu código de acceso.
fi: Syötä PIN-koodi.
ja: パスコードを入力してください。
ko: 암호를 입력하십시오.
zh_hans: 输入您的密码。

# lock.enter.passcode.view.model.touch.id
source: Logging in with Touch ID
es: Iniciando sesión con Touch ID
fi: Kirjaudu sormenjäljellä
ja: タッチ ID を使用してログイン
ko: Touch ID로 로그인
zh_hans: 使用 Touch ID 登录

# lock.enter.passcode.view.model.try.after.one.minute
source: Try after 1 minute.
es: Prueba dentro de 1 minuto.
fi: Yritä uudestaan minuutin kuluttua.
ja: 1 分後にもう一度試してください。
ko: 1분 후 시도하십시오.
zh_hans: 1 分钟后尝试。

source: Name
es: Nombre
fi: Nimi
ja: 名前
ko: 이름
zh_hans: 名称

# send.action.copy.transaction.title
source: Copy Transaction ID
es: Copiar ID de transacción
fi: Kopioi tilitapahtuman tunnisteen
ja: トランザクション ID をコピー
ko: 거래 ID 복사
zh_hans: 复制交易 ID

# send.action.transaction.sent
source: Transaction Sent!
es: ¡Transacción enviada!
fi: Tilitapahtuma lähtetty!
ja: トランザクションが送信されました!
ko: 거래 전송 완료!
zh_hans: 交易已发送！

# send.action.transaction.sent.wait
source: Wait for the transaction to be mined on the network to see details.
es: Espera a que la transacción se mine en la red para ver los detalles.
fi: Odota tapahtuman vahvistusta. Vasta sitten yksityiskohdat näkyvät.
ja: 詳細を表示するには、ネットワークでトランザクションがマイニングされるのをお待ちください。
ko: 네트워크에서 거래가 채굴될 때까지 기다린 후 세부 정보를 확인하십시오.
zh_hans: 请等待，交易在网络上被挖矿后方能查看详细信息。

# transaction.cell.failed.title
source: Failed
es: Fallida
fi: Epäonnistui
ja: 失敗しました
ko: 실패
zh_hans: 失效

# transaction.cell.pending.title
source: Pending
es: Pendiente
fi: Odottaa
ja: 保留中
ko: 대기 중
zh_hans: 未确定

# transaction.cell.availableButDataUnavailable.title
source: Incomplete Data
es: Datos incompletos
fi: Osa tiedoista puuttuu
zh_hans: 不完整数据

# walletTokens.tabbar.item.title
source: Wallet
es: Monedero
fi: Lompakko
ja: ウォレット
ko: 지갑
zh_hans: 我的钱包

# a.wallet.import.wallet.title
source: Import
es: Importar
fi: Tuo
ja: インポート
ko: 가져오기
zh_hans: 导入

# a.wallet.import.wallet.bubble.title
source: Have a ticket to import?
es: ¿Tienes que importar un ticket?
fi: Oletko saanut lipun?
ja: インポートするチケットがありますか?
ko: 가져올 지갑이 있습니까?
zh_hans: 有一张需要导入的门票？

# a.wallet.import.wallet.bubble.description
source: Check your Email/SMS for the import link. Tap it and it will automatically import to the app!
es: Revisa tu correo electrónico/SMS y busca el enlace de importación. ¡Pulsa en él y se importará automáticamente a la aplicación!
fi: Tarkista sähköpostista/tekstiviesteistä tuonti-linkki. Napsauta sitä ja se tuo lipun automaattisesti sovellukseen!
ja: メール/SMS でインポート リンクを確認します。リンクをタップすると、自動的にアプリにインポートされます!
ko: 이메일/SMS에서 가져오기 링크를 확인하십시오. 링크를 탭하면 앱을 자동으로 가져옵니다!
zh_hans: 检查您的电子邮件/短信以获取导入链接。点击此链接，其将自动导入到应用中！

# a.wallet.token.verifiedContract
source: VERIFIED
es: VERIFICADO
fi: TARKISTETTU
ja: 検証されました
ko: 검증된
zh_hans: 已验证

# a.wallet.token.unverifiedContract
source: UNVERIFIED
es: SIN VERIFICAR
fi: TARKISTAMATON
ja: 未検証
ko: 미확인
zh_hans: 未验证

# a.wallet.token.redeem.button.title
source: Redeem
es: Canjear
fi: Lunasta
ja: 交換
ko: 상환
zh_hans: 兑换

# a.wallet.token.redeem.selectTokens.title
source: Select %@ To Redeem:
es: Selecciona %@ para canjear:
fi: Valitse %@ lunastukseen:
ja: 交換する %@ を選択:
ko: 상환할 %@ 선택:
zh_hans: 选择要兑换的%@：

# a.wallet.token.redeem.selectTokenQuantity.atLeastOne.title
source: Please select quantity of %@
es: Selecciona la cantidad de %@
fi: Valitse määrä: %@
ja: %@ の量を選択してください
ko: %@의 수량을 선택하십시오
zh_hans: 请选择%@的数量

# a.wallet.token.redeem.selectTokens.atLeastOne.title
source: Please select a %@ to redeem
es: Selecciona un %@ para canjear
fi: Valitse %@ lunastukseen
ja: 交換する %@ を選択してください
ko: 상환할 %@을(를) 선택하십시오
zh_hans: 请选择一个要兑换的%@

# a.wallet.token.redeem.selectQuantity.title
source: Select Quantity of %@
es: Selecciona la cantidad de %@
fi: Valitse määrä: %@
ja: %@ の量を選択してください
ko: %@의 수량 선택
zh_hans: 选择%@数量

# a.wallet.token.redeem.quantity.title
source: QUANTITY OF %@
es: CANTIDAD DE %@
fi: MÄÄRÄ: %@
ja: %@ の量
ko: %@의 수량
zh_hans: %@的数量

# a.wallet.token.redeem.showQRCode.title
source: Show QR Code to Redemption Booth
es: Muestra el código QR en el puesto de canje
fi: Näytä QR-koodi lunastustiskillä
ja: 償還ブースに QR コードを表示
ko: 상환 부스에 QR 코드 표시
zh_hans: 呈递二维码到兑换台

# a.wallet.token.redeem.successful.title
source: Congrats
es: Enhorabuena
fi: Onnea
ja: おめでとうございます
ko: 축하합니다
zh_hans: 恭喜

# a.wallet.token.redeem.successful.description
source: You have successfully redeemed your %@
es: Has canjeado correctamente tu %@
fi: %@ lunastaminen onnistui
ja: %@ が正常に償還されました
ko: %@을(를) 성공적으로 상환하였습니다
zh_hans: 您已成功兑换您的%@

# a.wallet.token.sell.button.title
source: Sell
es: Vender
fi: Myy
ja: 売却
ko: 판매
zh_hans: 出售

# a.wallet.token.sell.selectTokens.title
source: Select %@ To Sell:
es: Selecciona %@ para vender:
fi: Valitse %@ myyntiin:
ja: 売却する %@ を選択:
ko: 판매할 %@ 선택:
zh_hans: 选择要出售的%@：

# a.wallet.token.sell.selectTokenQuantity.atLeastOne.title
source: Please select quantity of %@
es: Selecciona la cantidad de %@
fi: Valitse määrä: %@
ja: %@ の量を選択してください
ko: %@의 수량을 선택하십시오
zh_hans: 请选择%@的数量

# a.wallet.token.sell.price.provide.title
source: Please enter price of %@
es: Introduce el precio de %@
fi: Anna hinta tuotteelle %@
ja: %@ の価格を入力してください
ko: %@의 가격을 입력하십시오
zh_hans: 请输入%@的价格

# a.wallet.token.sell.selectTokens.atLeastOne.title
source: Please select a %@ to sell
es: Selecciona un %@ para vender
fi: Valitse %@ myyntiin
ja: 売却する %@ を選択してください
ko: 판매할 %@을(를) 선택하십시오
zh_hans: 请选择一个要出售的%@

# a.wallet.token.sell.selectQuantity.title
source: Set a Price
es: Fija un precio
fi: Aseta hinta
ja: 価格の設定
ko: 가격 설정
zh_hans: 设置一个价格

# a.wallet.token.sell.pricePerToken.title
source: PRICE PER %@
es: PRECIO POR %@
fi: YKSIKKÖHINTA: %@
ja: %@ あたりの価格
ko: %@당 가격
zh_hans: 每%@的价格

# a.wallet.token.sell.dollarCostLabel.title
source: EQUIVALENT IN USD
es: EQUIVALENTE EN USD
fi: VASTAAVA USD HINTA
ja: 米ドルでの相当額
ko: USD 상응 가치
zh_hans: 等值美元

# a.wallet.token.sell.quantity.title
source: QUANTITY OF %@
es: CANTIDAD DE %@
fi: MÄÄRÄ: %@
ja: %@ の量
ko: %@의 수량
zh_hans: %@的数量

# a.wallet.token.sell.enterLinkExpiryDate.title
source: Set MagicLink Expiry
es: Define la expiración del MagicLink
fi: Aseta MagicLink-linkin voimassaolo
ja: MagicLink 有効期限の設定
ko: MagicLink 만료 날짜 설정
zh_hans: 设置 MagicLink 过期时间

# a.wallet.token.sell.singleTokenSelected.title
source: 1 %@ Selected
es: 1 %@ seleccionado
fi: 1 %@ valittu
ja: 1 つの %@ を選択
ko: 1개의 %@이 선택됨
zh_hans: 已选择 1 个 %@

# a.wallet.token.sell.multipleTokenSelected.title
source: %d %@ Selected
es: %d %@ seleccionados
fi: %d %@ valittu
ja: %d 個の %@ を選択
ko: %d개의 %@이 선택됨
zh_hans: 已选择 %d 个%@

# a.wallet.token.sell.totalEthPrice.title
source: Total: %@ %@
fi: Yhteensä: %@ %@
ja: 合計: %@ %@
ko: 합계: %@ %@
zh_hans: 总计：%@%@

# a.wallet.token.sell.magicLinkDescription.title
source: A MagicLink will be created to allow buyers to purchase your %@.
es: Se creará un MagicLink para que los compradores puedan adquirir tu %@.
fi: Luodaan MagicLink-linkki, jonka avulla ostaja voi ostaa tuotteesi %@.
ja: MagicLink が作成され、バイヤーがあなたの %@ を購入できるようになります。
ko: 구매자가 고객님의 %@을(를) 구매할 수 있도록 MagicLink가 생성됩니다.
zh_hans: 将创建一个 MagicLink 链接，以便卖家购买您的%@。

# a.wallet.token.sell.noteTitleLabel.title
source: IMPORTANT
es: IMPORTANTE
fi: TÄRKEÄÄ
ja: 重要
ko: 중요
zh_hans: 重要事项

# a.wallet.token.sell.noteLabel.title
source: Before the link expires, anyone with the MagicLink can purchase your %@ with one click
es: Antes de que expire el enlace, cualquiera que tenga el MagicLink puede comprar tu %@ con un clic
fi: MagicLink-linkin voimassaoloajan kuka tahansa voi ostaa tuotteesi %@ yhdellä näpäytyksellä.
ja: リンクの有効期限が切れる前に、MagicLink を持つユーザーはワンクリックであなたの %@ を購入できます
ko: 링크가 만료되기 전에 MagicLink가 있는 사람은 한 번 클릭하여 고객님의 %@을(를) 구매할 수 있습니다
zh_hans: 在 MagicLink 链接过期之前，任何人均可通过点击此链接来购买您的%@

# a.wallet.token.sell.linkExpiryDate.title
source: LINK EXPIRY DATE
es: FECHA DE EXPIRACIÓN DEL ENLACE
fi: LINKIN PÄÄTTYMISPÄIVÄ
ja: リンクの有効期限日
ko: 링크 만료 날짜
zh_hans: 链接失效日期

# a.wallet.token.sell.linkExpiryTime.title
source: LINK EXPIRY TIME
es: HORA DE EXPIRACIÓN DEL ENLACE
fi: LINKIN PÄÄTTYMISAIKA
ja: リンクの有効期限の時間
ko: 링크 만료 시간
zh_hans: 链接失效时间

# a.wallet.token.sell.linkExpiryTime.atLeastNow.title
source: Please select a date in the future
es: Selecciona una fecha que se encuentre en el futuro
fi: Valitse tulevaisuudessa oleva päivämäärä
ja: 今後の日付を選択してください
ko: 미래의 날짜를 선택하십시오
zh_hans: 请选择一个未来日期

# a.wallet.token.sell.totalCost.title
source: Total Cost:
es: Coste total:
fi: Kokonaiskustannukset:
ja: 合計費用:
ko: 총 비용:
zh_hans: 总价:

# a.wallet.token.sell.confirm.title
source: Confirm Sale?
es: ¿Confirmar venta?
fi: Vahvista myynti?
ja: 売却を確定しますか?
ko: 판매하시겠습니까?
zh_hans: 确认出售?

# a.wallet.token.sell.confirm.subtitle
source: Generate Sale Link
es: Generar enlace de venta
fi: Luo myyntilinkki
ja: 売却リンクを生成
ko: 판매 링크 생성
zh_hans: 生成销售链接

# a.wallet.token.sell.confirm.cancel.button.title
source: Cancel
es: Cancelar
fi: Peru
ja: キャンセル
ko: 취소
zh_hans: 取消

# a.wallet.token.sell.confirm.button.title
source: Share MagicLink
es: Compartir MagicLink
fi: Jaa MagicLink-linkki
ja: MagicLink をシェア
ko: MagicLink 공유
zh_hans: 创建链接

# a.wallet.token.sell.confirm.expiryDateDescription
source: MagicLink expires on: %@
es: MagicLink expira el: %@
fi: MagicLink-linkkin voimassaolo päättyy: %@
ja: MagicLink の有効期限: %@
ko: MagicLink 만료 날짜: %@
zh_hans: MagicLink 过期时间：%@

# a.wallet.token.transfer.button.title
source: Send
es: Transferir
fi: Lähetä
ja: 送信
ko: 전송
zh_hans: 转让

# a.wallet.token.transfer.selectTokens.title
source: Select %@ To Transfer:
es: Selecciona %@ para transferir:
fi: Valitse %@ lähtetykseen:
ja: 送信する %@ を選択:
ko: 전송할 %@ 선택:
zh_hans: 选择要转出的%@：

# a.wallet.token.transfer.selectTokenQuantity.atLeastOne.title
source: Please select quantity of %@
es: Selecciona la cantidad de %@
fi: Valitse tuotteen %@ määrä
ja: %@ の量を選択してください
ko: %@의 수량을 선택하십시오
zh_hans: 请选择%@的数量

# a.wallet.token.transfer.selectTokens.atLeastOne.title
source: Please select a %@ to transfer
es: Selecciona un %@ para transferir
fi: Valitse %@ lähetettäväksi
ja: 送信する %@ を選択してください
ko: 전송할 %@을(를) 선택하십시오
zh_hans: 请选择一个要转出的%@

# a.wallet.token.transfer.selectQuantity.title
source: Transfer %@
es: Transferir %@
fi: Lähetä %@
ja: %@ を送信
ko: %@ 전송
zh_hans: 转出%@

# a.wallet.token.transfer.quantity.title
source: QUANTITY OF %@
es: CANTIDAD DE %@
fi: MÄÄRÄ: %@
ja: %@ の量
ko: %@의 수량
zh_hans: %@的数量

# a.wallet.token.transfer.mode.magicLink.button.title
source: MagicLink for Picking Up
es: MagicLink para recogida
fi: MagicLink-linkki toimitusta varten
ja: ピックアップするための MagicLink
ko: 취득용 MagicLink
zh_hans: 用于购买的 MagicLink

# a.wallet.token.transfer.mode.now.button.title
source: Transfer now
es: Transferir ahora
fi: Lähetä nyt
ja: 今すぐ送信
ko: 지금 전송
zh_hans: 立即转出

# a.wallet.token.transfer.confirm.title
source: Generate MagicLink
es: Generar MagicLink
fi: Luo MagicLink
ja: MagicLink の生成
ko: MagicLink 생성
zh_hans: 创建销售链接

# a.wallet.token.transfer.confirm.subtitle
source: Generate Free Transfer Link
es: Generar enlace de transferencia gratis
fi: Luo Free Transfer Link -linkki
ja: 無料送信リンクを生成
ko: 무료 전송 링크 생성
zh_hans: 生成免费转让链接

# a.wallet.token.transfer.mode.walletAddress.confirmation
source: Transfer to wallet address %@?
es: ¿Transferir a la dirección de monedero %@?
fi: Lähetä lompakko-osoitteeseen %@?
ja: ウォレット アドレス %@ に送信しますか?
ko: 지갑 주소 %@(으)로 전송하시겠습니까?
zh_hans: 转至钱包地址 %@ ？

# a.wallet.token.transfer.magicLinkDescription.title
source: The MagicLink will be valid until:
es: El MagicLink será válido hasta:
fi: MagicLink-linkin voimassaolo päättyy:
ja: MagicLink の有効期限:
ko: MagicLink 유효 기간:
zh_hans: MagicLink 有效期至：

# a.wallet.token.transfer.linkExpiryTime.atLeastNow.title
source: Please select a date in the future
es: Selecciona una fecha que se encuentre en el futuro
fi: Valitse tulevaisuudessa oleva päivämäärä
ja: 今後の日付を選択してください
ko: 미래의 날짜를 선택하십시오
zh_hans: 请选择一个未来日期

# a.wallet.token.transfer
source: PHONE NUMBER
es: NÚMERO DE TELÉFONO
fi: PUHELINNUMERO
ja: 電話番号
ko: 전화번호
zh_hans: 电话号码
